[
  {
    "id": "clf-c02-security_compliance-001",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS ajuda a identificar o usuário que excluiu uma instância do Amazon EC2 ontem?",
    "option_a": "Amazon CloudWatch",
    "option_b": "AWS Trusted Advisor",
    "option_c": "AWS CloudTrail",
    "option_d": "Amazon Inspector",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS CloudTrail registra a atividade da conta e as chamadas de API, permitindo que você veja quem realizou ações como a terminação de uma instância EC2 e quando.",
    "incorrect_explanations": {
      "A": "O CloudWatch monitora métricas e logs para dados de desempenho e operacionais, não a identidade do usuário e o histórico de API.",
      "B": "O Trusted Advisor fornece verificações e recomendações de melhores práticas; ele não registra quem realizou ações de API específicas.",
      "D": "O Inspector avalia as cargas de trabalho em busca de vulnerabilidades e desvios, não a atribuição de atividades de API."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-002",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de uma rede de entrega de conteúdo que entregue dados, vídeos, aplicações e APIs de forma segura globalmente com baixa latência e altas velocidades de transferência. Qual serviço da AWS atende a esses requisitos?",
    "option_a": "Amazon CloudFront",
    "option_b": "Elastic Load Balancing",
    "option_c": "Amazon S3",
    "option_d": "Amazon Elastic Transcoder",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon CloudFront é a CDN global da AWS que armazena em cache e entrega conteúdo de forma segura com baixa latência a partir de locais de borda em todo o mundo.",
    "incorrect_explanations": {
      "B": "O Elastic Load Balancing distribui o tráfego entre os alvos; não é uma CDN global.",
      "C": "O Amazon S3 é um armazenamento de objetos; ele não fornece cache de borda e distribuição global por si só.",
      "D": "O Elastic Transcoder converte formatos de mídia; não é para entrega de conteúdo."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-003",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O Amazon Elastic File System (Amazon EFS) e o Amazon FSx fornecem qual tipo de armazenamento?",
    "option_a": "Armazenamento de arquivos",
    "option_b": "Armazenamento de objetos",
    "option_c": "Armazenamento de blocos",
    "option_d": "Armazenamento de instância",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon EFS e o Amazon FSx são serviços gerenciados de armazenamento de arquivos que expõem sistemas de arquivos acessíveis pela rede.",
    "incorrect_explanations": {
      "B": "O armazenamento de objetos é fornecido por serviços como o Amazon S3.",
      "C": "O armazenamento de blocos é fornecido pelo Amazon EBS.",
      "D": "O armazenamento de instância refere-se a discos efêmeros anexados a instâncias EC2."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-004",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Um varejista está migrando sua TI local para a AWS. Quais custos são eliminados ao mover para a nuvem? (Selecione DOIS)",
    "option_a": "Custos de operações de data center",
    "option_b": "Custos de licenciamento de aplicativos",
    "option_c": "Custos de campanhas de marketing",
    "option_d": "Custos de hardware de servidor físico",
    "option_e": "Custos de gerenciamento de rede",
    "correct_answers": [
      "A",
      "D"
    ],
    "explanation_detailed": "A migração para a AWS remove a necessidade de operar data centers físicos e de comprar e manter hardware de servidor físico.",
    "incorrect_explanations": {
      "B": "O licenciamento de software ainda pode ser necessário dependendo dos produtos e modelos.",
      "C": "As despesas de marketing são independentes do local de hospedagem.",
      "E": "O gerenciamento de rede continua necessário, embora sua natureza mude na nuvem."
    }
  },
  {
    "id": "clf-c02-security_compliance-005",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que atua como um firewall no nível da instância para controlar o acesso de entrada e saída?",
    "option_a": "Listas de controle de acesso à rede (ACLs)",
    "option_b": "Grupos de segurança",
    "option_c": "AWS Trusted Advisor",
    "option_d": "Gateways privados virtuais",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Grupos de segurança são firewalls virtuais com estado que controlam o tráfego de entrada e saída no nível da instância.",
    "incorrect_explanations": {
      "A": "NACLs operam no nível da sub-rede e são sem estado.",
      "C": "O Trusted Advisor fornece recomendações, não filtragem de pacotes.",
      "D": "Um gateway privado virtual termina uma VPN; não é um firewall."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-006",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma Zona de Disponibilidade consiste em:",
    "option_a": "Um ou mais data centers em uma única localização",
    "option_b": "Dois ou mais data centers em múltiplas localizações",
    "option_c": "Um ou mais hosts físicos em um único data center",
    "option_d": "Dois ou mais hosts físicos em múltiplos data centers",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Uma Zona de Disponibilidade é um ou mais data centers discretos com energia, rede e conectividade redundantes em uma única área geográfica.",
    "incorrect_explanations": {
      "B": "Múltiplas localizações definem múltiplas Zonas de Disponibilidade ou Regiões, não uma única Zona de Disponibilidade.",
      "C": "Uma Zona de Disponibilidade é mais ampla do que alguns hosts; ela compreende data center(s) completo(s).",
      "D": "Abranger múltiplos data centers ainda pode ser uma Zona de Disponibilidade, mas 'em múltiplos data centers' não é a opção definidora aqui."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-007",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais são os princípios de design da nuvem AWS? (Selecione DOIS)",
    "option_a": "Pagar pelos recursos de computação antecipadamente",
    "option_b": "Usar decisões baseadas em dados para o design arquitetônico",
    "option_c": "Enfatizar processos manuais para permitir mudanças",
    "option_d": "Testar sistemas em escala de produção",
    "option_e": "Refinar procedimentos operacionais com pouca frequência",
    "correct_answers": [
      "B",
      "D"
    ],
    "explanation_detailed": "As decisões de design devem ser baseadas em dados, e testar em escala de produção valida a resiliência e o desempenho em condições reais.",
    "incorrect_explanations": {
      "A": "A nuvem incentiva a despesa variável em vez de despesas de capital iniciais.",
      "C": "A automação, não os processos manuais, permite mudanças seguras e rápidas.",
      "E": "O refinamento contínuo e frequente melhora as operações."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-008",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual ferramenta da AWS fornece recomendações de dimensionamento correto para o Amazon EC2 com base em métricas históricas de carga de trabalho?",
    "option_a": "Calculadora de Preços da AWS",
    "option_b": "AWS Compute Optimizer",
    "option_c": "AWS App Runner",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Compute Optimizer analisa a utilização histórica para recomendar tipos e tamanhos ideais de instâncias EC2.",
    "incorrect_explanations": {
      "A": "A Calculadora de Preços estima custos; ela não analisa a utilização.",
      "C": "O App Runner executa aplicativos web/containerizados; ele não dimensiona corretamente o EC2.",
      "D": "O Systems Manager lida com tarefas de operações; ele não produz análises de dimensionamento correto."
    }
  },
  {
    "id": "clf-c02-security_compliance-009",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Sob o modelo de responsabilidade compartilhada da AWS, quais tarefas são responsabilidades da AWS? (Selecione DOIS)",
    "option_a": "Aplicação de patches em dispositivos de rede da AWS",
    "option_b": "Definição de políticas de senha de usuário",
    "option_c": "Fornecimento de segurança física para recursos de computação",
    "option_d": "Configuração de grupos de segurança",
    "option_e": "Aplicação de patches no SO de uma instância do Amazon EC2",
    "correct_answers": [
      "A",
      "C"
    ],
    "explanation_detailed": "A AWS é responsável pela segurança 'da' nuvem, incluindo segurança física e manutenção de dispositivos de infraestrutura gerenciados pela AWS.",
    "incorrect_explanations": {
      "B": "Os clientes definem políticas do IAM e requisitos de senha.",
      "D": "Os clientes configuram seus próprios controles de rede, como grupos de segurança.",
      "E": "A aplicação de patches no nível do SO em instâncias EC2 é responsabilidade do cliente."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-010",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma equipe de TI gerencia clusters de banco de dados MySQL e deve aplicar patches no BD e fazer backups. A empresa quer que a AWS automatize essas tarefas. O que eles devem usar?",
    "option_a": "Implantar clusters MySQL em instâncias do Amazon EC2",
    "option_b": "Usar o Amazon RDS para MySQL",
    "option_c": "Usar um modelo do AWS CloudFormation para implantar o MySQL no EC2",
    "option_d": "Migrar todos os dados do MySQL para o Amazon S3",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon RDS automatiza tarefas rotineiras como backups, aplicação de patches e atualizações de versões menores para bancos de dados MySQL gerenciados.",
    "incorrect_explanations": {
      "A": "Executar BDs no EC2 deixa a aplicação de patches e os backups para o cliente.",
      "C": "O CloudFormation automatiza o provisionamento, não as operações de BD gerenciadas.",
      "D": "O S3 é armazenamento de objetos, não um serviço de banco de dados relacional gerenciado."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-011",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa deve coletar, analisar e armazenar dados localmente enquanto estende os serviços da AWS para seu data center com acesso de rede à sua VPC. Qual serviço atende a essa necessidade?",
    "option_a": "AWS Outposts",
    "option_b": "AWS Storage Gateway",
    "option_c": "AWS Direct Connect",
    "option_d": "AWS Snowball",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Outposts traz serviços, infraestrutura e modelos operacionais nativos da AWS para o local para uma experiência híbrida consistente.",
    "incorrect_explanations": {
      "B": "O Storage Gateway fornece integração de armazenamento híbrido, não serviços gerais da AWS no local.",
      "C": "O Direct Connect é um link de rede privado, não uma plataforma de extensão de serviço.",
      "D": "O Snowball é para transferência e processamento de dados na borda, não para hospedagem contínua de serviços da AWS no local."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-012",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma arquitetura sem servidor deve conectar dados de várias fontes de aplicação sem código adicional. Qual serviço da AWS se encaixa?",
    "option_a": "AWS Lambda",
    "option_b": "Amazon Simple Queue Service (Amazon SQS)",
    "option_c": "Amazon CloudWatch",
    "option_d": "Amazon EventBridge",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon EventBridge fornece um barramento de eventos sem servidor com integrações e regras de roteamento integradas, permitindo conexões orientadas a eventos sem código.",
    "incorrect_explanations": {
      "A": "O Lambda requer código; a pergunta pede por nenhuma codificação adicional.",
      "B": "O SQS é um serviço de fila; a lógica de integração ainda precisa de código.",
      "C": "O CloudWatch é para monitoramento e eventos de serviços da AWS, não um barramento de integração geral."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-013",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação no Amazon EC2 experimenta picos de demanda repentinos. Qual serviço garante que ela responda à demanda variável com o menor custo?",
    "option_a": "AWS Auto Scaling",
    "option_b": "AWS Compute Optimizer",
    "option_c": "AWS Cost Explorer",
    "option_d": "AWS Well-Architected Framework",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Auto Scaling ajusta a capacidade automaticamente para manter o desempenho enquanto minimiza os custos.",
    "incorrect_explanations": {
      "B": "O Compute Optimizer recomenda tamanhos; ele não escala a capacidade em tempo real.",
      "C": "O Cost Explorer analisa os gastos; ele não escala aplicações.",
      "D": "O Well-Architected é uma orientação, não um serviço de auto scaling."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-014",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais são as vantagens da Nuvem AWS? (Selecione DOIS)",
    "option_a": "Trocar despesa variável por despesa de capital",
    "option_b": "Economias de escala massivas",
    "option_c": "Implantação global em minutos",
    "option_d": "Foco no gerenciamento de infraestrutura de hardware",
    "option_e": "Superprovisionar para garantir a capacidade",
    "correct_answers": [
      "B",
      "C"
    ],
    "explanation_detailed": "A nuvem oferece economias de escala e a capacidade de implantar globalmente em minutos usando serviços gerenciados e automação.",
    "incorrect_explanations": {
      "A": "A nuvem muda de despesa de capital para despesa variável, não o contrário.",
      "D": "Os serviços gerenciados reduzem a necessidade de gerenciar hardware físico.",
      "E": "O auto scaling reduz a necessidade de superprovisionar."
    }
  },
  {
    "id": "clf-c02-security_compliance-015",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Sob o modelo de responsabilidade compartilhada da AWS, quais são as responsabilidades do cliente? (Selecione DOIS)",
    "option_a": "Determinar as dependências da aplicação com os sistemas operacionais",
    "option_b": "Fornecer acesso de usuário com o AWS Identity and Access Management (IAM)",
    "option_c": "Garantir a segurança física dos data centers em uma Zona de Disponibilidade",
    "option_d": "Aplicar patches no hipervisor",
    "option_e": "Garantir a disponibilidade da rede entre as Zonas de Disponibilidade",
    "correct_answers": [
      "A",
      "B"
    ],
    "explanation_detailed": "Os clientes gerenciam suas aplicações e identidades, incluindo o gerenciamento de dependências e os controles de acesso do IAM.",
    "incorrect_explanations": {
      "C": "A AWS lida com a segurança física de suas instalações.",
      "D": "A AWS gerencia a camada do hipervisor.",
      "E": "A AWS fornece a disponibilidade da rede principal entre as Zonas de Disponibilidade."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-016",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que promove as melhores práticas arquitetônicas da AWS para projetar e operar sistemas confiáveis, seguros, eficientes e econômicos?",
    "option_a": "AWS Serverless Application Model (SAM)",
    "option_b": "AWS Business Support",
    "option_c": "Princípio do menor privilégio",
    "option_d": "AWS Well-Architected Framework",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS Well-Architected Framework fornece pilares e orientações para construir e operar cargas de trabalho seguindo as melhores práticas.",
    "incorrect_explanations": {
      "A": "O SAM é um framework para construir aplicativos sem servidor, não uma orientação arquitetônica geral.",
      "B": "O Business Support é um plano de suporte, não um framework de design.",
      "C": "O menor privilégio é um princípio de segurança, não um framework de arquitetura abrangente."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-017",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Usar o Amazon ECS para quebrar um monólito em microsserviços é um exemplo de:",
    "option_a": "Uma arquitetura fracamente acoplada",
    "option_b": "Uma arquitetura fortemente acoplada",
    "option_c": "Uma arquitetura sem estado (stateless)",
    "option_d": "Uma arquitetura com estado (stateful)",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Os microsserviços promovem o acoplamento fraco para que os componentes possam evoluir de forma independente e se comunicar por meio de interfaces bem definidas.",
    "incorrect_explanations": {
      "B": "Sistemas fortemente acoplados têm interdependências que dificultam mudanças independentes.",
      "C": "A ausência de estado é ortogonal; os microsserviços podem ser com ou sem estado.",
      "D": "Com estado vs. sem estado não é o principal atributo de acoplamento aqui."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-018",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Após migrar para a AWS, uma empresa pode provisionar instâncias EC2 extras conforme necessário e lançar campanhas em 3 dias em vez de 3 semanas. Qual benefício da nuvem isso demonstra?",
    "option_a": "Economia de custos",
    "option_b": "Melhora da resiliência operacional",
    "option_c": "Aumento da agilidade de negócios",
    "option_d": "Segurança aprimorada",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O provisionamento e o dimensionamento rápidos reduzem o tempo de lançamento no mercado, ilustrando o aumento da agilidade de negócios.",
    "incorrect_explanations": {
      "A": "O custo pode melhorar, mas o cenário destaca a velocidade e a flexibilidade.",
      "B": "A resiliência se concentra na confiabilidade e na recuperação, não em lançamentos mais rápidos.",
      "D": "A segurança não é o foco deste cenário."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-019",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa faz backup de 10 TB para uma biblioteca de fitas usando software de terceiros. O servidor de backup local está ficando sem espaço. Eles querem usar a AWS para backups sem alterar os fluxos de trabalho existentes. Qual serviço eles devem usar?",
    "option_a": "Amazon Elastic Block Store (Amazon EBS)",
    "option_b": "AWS Storage Gateway",
    "option_c": "Amazon Elastic Container Service (Amazon ECS)",
    "option_d": "AWS Lambda",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Storage Gateway Tape Gateway apresenta bibliotecas de fitas virtuais compatíveis com aplicações de backup existentes, permitindo backups em nuvem sem alterações no fluxo de trabalho.",
    "incorrect_explanations": {
      "A": "O EBS é armazenamento de blocos para o EC2, não uma solução de fita virtual.",
      "C": "O ECS executa contêineres e não substitui os fluxos de trabalho de fita.",
      "D": "O Lambda é computação sem servidor e não é usado para integração de backup em fita."
    }
  },
  {
    "id": "clf-c02-security_compliance-020",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa monitorar continuamente a atividade da conta e da rede para identificar possíveis ameaças à segurança. Qual serviço da AWS eles devem usar?",
    "option_a": "AWS Artifact",
    "option_b": "Amazon Macie",
    "option_c": "AWS Identity and Access Management (IAM)",
    "option_d": "Amazon GuardDuty",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon GuardDuty analisa continuamente os logs e a atividade da rede para detectar comportamento malicioso ou não autorizado em contas da AWS.",
    "incorrect_explanations": {
      "A": "O Artifact fornece relatórios de conformidade, não detecção de ameaças.",
      "B": "O Macie descobre e protege dados sensíveis, não detecção geral de ameaças.",
      "C": "O IAM gerencia identidades e permissões, não análises de ameaças."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-021",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um engenheiro de nuvem quer a porcentagem de unidades de computação alocadas em uso para uma instância específica do Amazon EC2. Qual serviço fornece isso?",
    "option_a": "AWS CloudTrail",
    "option_b": "AWS Config",
    "option_c": "Amazon CloudWatch",
    "option_d": "AWS Artifact",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon CloudWatch fornece métricas do EC2, como CPUUtilization, para avaliar o uso da computação.",
    "incorrect_explanations": {
      "A": "O CloudTrail registra chamadas de API, não métricas de desempenho.",
      "B": "O Config rastreia alterações de configuração, não utilização.",
      "D": "O Artifact hospeda documentação de conformidade, não métricas."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-022",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS é usado para solucionar problemas de conectividade de rede entre instâncias do Amazon EC2?",
    "option_a": "AWS Certificate Manager (ACM)",
    "option_b": "Gateway da internet",
    "option_c": "Logs de Fluxo da VPC",
    "option_d": "AWS CloudHSM",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Logs de Fluxo da VPC capturam metadados de tráfego IP para ENIs, permitindo a análise de tráfego permitido/negado para solução de problemas.",
    "incorrect_explanations": {
      "A": "O ACM gerencia certificados; ele não fornece logs de tráfego.",
      "B": "Um gateway da internet permite o acesso à internet; ele não registra fluxos.",
      "D": "O CloudHSM fornece módulos de segurança de hardware, não relacionados à análise de fluxo."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-023",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece armazenamento de objetos altamente durável?",
    "option_a": "Amazon S3",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Amazon FSx",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon S3 é projetado para 11 noves de durabilidade para objetos armazenados, tornando-o um armazenamento de objetos altamente durável.",
    "incorrect_explanations": {
      "B": "O EFS é um sistema de arquivos gerenciado, não armazenamento de objetos.",
      "C": "O EBS é armazenamento de blocos para volumes do EC2.",
      "D": "O FSx fornece sistemas de arquivos gerenciados, não armazenamento de objetos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-024",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece uma conexão de rede privada dedicada de uma rede local para a AWS?",
    "option_a": "AWS CloudHSM",
    "option_b": "AWS Direct Connect",
    "option_c": "AWS VPN",
    "option_d": "Amazon Connect",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Direct Connect estabelece conectividade dedicada e privada entre ambientes locais e a AWS.",
    "incorrect_explanations": {
      "A": "O CloudHSM fornece hardware criptográfico, não conectividade.",
      "C": "A AWS VPN é criptografada pela internet, não um circuito privado dedicado.",
      "D": "O Amazon Connect é um serviço de contact center."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-025",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa usa software de terceiros para fazer backup de 10 TB em fitas e quer manter os fluxos de trabalho existentes enquanto aproveita a AWS. Qual serviço deve usar?",
    "option_a": "Amazon Elastic Block Store (Amazon EBS)",
    "option_b": "AWS Storage Gateway",
    "option_c": "Amazon Elastic Container Service (Amazon ECS)",
    "option_d": "AWS Lambda",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Storage Gateway Tape Gateway se integra a aplicativos de backup comuns por meio de fitas virtuais, permitindo backups na nuvem com mudanças mínimas.",
    "incorrect_explanations": {
      "A": "O EBS é para armazenamento de blocos do EC2, não para fluxos de trabalho de fita virtual.",
      "C": "O ECS orquestra contêineres, não relacionado a backups em fita.",
      "D": "O Lambda é computação sob demanda, não integração de backup."
    }
  },
  {
    "id": "clf-c02-security_compliance-026",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de monitoramento contínuo para analisar a atividade da conta e da rede em busca de ameaças. Qual serviço deve usar?",
    "option_a": "AWS Artifact",
    "option_b": "Amazon Macie",
    "option_c": "AWS Identity and Access Management (IAM)",
    "option_d": "Amazon GuardDuty",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O GuardDuty analisa continuamente logs e telemetria de rede para detectar comportamento suspeito ou malicioso.",
    "incorrect_explanations": {
      "A": "O Artifact fornece relatórios e acordos de conformidade.",
      "B": "O Macie se concentra na descoberta e proteção de dados sensíveis.",
      "C": "O IAM gerencia identidades e permissões, não análises de ameaças."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-027",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço fornece a porcentagem de unidades de computação alocadas em uso para uma instância EC2?",
    "option_a": "AWS CloudTrail",
    "option_b": "AWS Config",
    "option_c": "Amazon CloudWatch",
    "option_d": "AWS Artifact",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O CloudWatch expõe métricas de desempenho do EC2 como CPUUtilization, mostrando quanto da computação está sendo usada.",
    "incorrect_explanations": {
      "A": "O CloudTrail registra chamadas de API, não métricas de desempenho.",
      "B": "O Config registra alterações de configuração, não uso.",
      "D": "O Artifact é para documentos de conformidade, não métricas."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-028",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para solucionar problemas de conectividade entre instâncias EC2, qual recurso da AWS deve ser usado?",
    "option_a": "AWS Certificate Manager (ACM)",
    "option_b": "Gateway da internet",
    "option_c": "Logs de Fluxo da VPC",
    "option_d": "AWS CloudHSM",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Logs de Fluxo da VPC fornecem metadados de fluxo de tráfego para interfaces, permitindo a análise de tráfego permitido e negado.",
    "incorrect_explanations": {
      "A": "O ACM gerencia certificados TLS; ele não registra tráfego.",
      "B": "Um gateway da internet permite acesso à internet; não fornece diagnósticos.",
      "D": "O CloudHSM é para operações de chave criptográfica."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-029",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço fornece armazenamento de objetos altamente durável?",
    "option_a": "Amazon S3",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Amazon FSx",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon S3 é projetado para durabilidade muito alta de objetos armazenados em várias instalações.",
    "incorrect_explanations": {
      "B": "O EFS é armazenamento de arquivos de rede.",
      "C": "O EBS é armazenamento de blocos para o EC2.",
      "D": "O FSx é armazenamento de arquivos gerenciado."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-030",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer que as instâncias EC2 permaneçam altamente disponíveis mesmo que um desastre natural impacte uma área geográfica. Qual solução atinge isso?",
    "option_a": "Usar o EC2 em uma única Zona de Disponibilidade",
    "option_b": "Usar o EC2 em várias Regiões da AWS",
    "option_c": "Usar o EC2 em vários locais de borda",
    "option_d": "Usar o Amazon CloudFront com o EC2 como origem",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A implantação em várias Regiões fornece redundância geográfica contra desastres em nível de região.",
    "incorrect_explanations": {
      "A": "Uma única Zona de Disponibilidade é um único ponto de falha dentro de uma Região.",
      "C": "Locais de borda servem conteúdo de CDN, não a colocação de computação do EC2.",
      "D": "O CloudFront distribui conteúdo; não torna a computação multi-regional."
    }
  },
  {
    "id": "clf-c02-security_compliance-031",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS um engenheiro de nuvem deve usar para visualizar chamadas de API feitas aos serviços da AWS?",
    "option_a": "Amazon CloudWatch",
    "option_b": "AWS CloudTrail",
    "option_c": "AWS Config",
    "option_d": "AWS Artifact",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS CloudTrail registra e expõe eventos de API em contas e serviços da AWS.",
    "incorrect_explanations": {
      "A": "O CloudWatch é para métricas e logs, não trilhas de auditoria de API.",
      "C": "O Config rastreia alterações de configuração, não históricos de chamadas de API.",
      "D": "O Artifact fornece relatórios de conformidade, não logs de API."
    }
  },
  {
    "id": "clf-c02-security_compliance-032",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa definir regras para identificar ameaças e proteger aplicações de tráfego web malicioso. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS Identity and Access Management (IAM)",
    "option_b": "Amazon QuickSight",
    "option_c": "AWS WAF",
    "option_d": "Amazon Detective",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS WAF permite regras personalizadas e gerenciadas para bloquear exploits web comuns e padrões maliciosos.",
    "incorrect_explanations": {
      "A": "O IAM controla identidades e permissões, não a filtragem de solicitações HTTP.",
      "B": "O QuickSight é um serviço de BI/análise.",
      "D": "O Detective ajuda em investigações de segurança, mas não é um firewall de aplicação web."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-033",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer migrar seu data warehouse local para a AWS para alimentar painéis de análise. Qual serviço deve usar?",
    "option_a": "Amazon ElastiCache",
    "option_b": "Amazon Aurora",
    "option_c": "Amazon RDS",
    "option_d": "Amazon Redshift",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon Redshift é um data warehouse totalmente gerenciado em escala de petabytes, otimizado para consultas analíticas.",
    "incorrect_explanations": {
      "A": "O ElastiCache é para cache em memória, não para armazenamento de dados.",
      "B": "O Aurora é um banco de dados relacional para cargas de trabalho OLTP.",
      "C": "O RDS gerencia motores relacionais, mas não é um data warehouse colunar."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-034",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Uma empresa precisa hospedar bancos de dados relacionais com esquemas predefinidos na AWS. Quais serviços poderia usar? (Selecione DOIS)",
    "option_a": "Amazon Aurora",
    "option_b": "Amazon RDS",
    "option_c": "Amazon DocumentDB (com compatibilidade com MongoDB)",
    "option_d": "Amazon Neptune",
    "option_e": "Amazon DynamoDB",
    "correct_answers": [
      "A",
      "B"
    ],
    "explanation_detailed": "O Amazon Aurora e o Amazon RDS são serviços de banco de dados relacional gerenciados, adequados para cargas de trabalho baseadas em esquema.",
    "incorrect_explanations": {
      "C": "O DocumentDB é um banco de dados de documentos, não relacional.",
      "D": "O Neptune é um banco de dados de grafos.",
      "E": "O DynamoDB é um banco de dados NoSQL de chave-valor/documento."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-035",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um varejista está construindo um novo aplicativo móvel e avaliando executá-lo localmente ou na AWS. Qual serviço ele deveria considerar dentre as opções fornecidas?",
    "option_a": "Amazon FSx for Windows File Server",
    "option_b": "Desktop virtual do Amazon WorkSpaces Windows",
    "option_c": "AWS Directory Service for Microsoft Active Directory",
    "option_d": "Amazon RDS for Microsoft SQL Server",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS Directory Service for Microsoft Active Directory fornece recursos de AD gerenciados que podem integrar identidade e política com o ambiente do aplicativo quando o AD é necessário.",
    "incorrect_explanations": {
      "A": "O FSx for Windows fornece compartilhamentos de arquivos SMB, não serviços de identidade de aplicativos.",
      "B": "O WorkSpaces oferece desktops virtuais; não é uma escolha de plataforma de aplicativo.",
      "D": "O RDS for SQL Server fornece um banco de dados, não um diretório/identidade ou avaliação de hospedagem de aplicativo por si só."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-036",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais princípios de design apoiam o pilar de Confiabilidade do AWS Well-Architected Framework? (Selecione DOIS)",
    "option_a": "Realizar operações como código",
    "option_b": "Habilitar a rastreabilidade",
    "option_c": "Escalar horizontalmente ou automaticamente para atender à demanda",
    "option_d": "Implantar globalmente principalmente para reduzir a latência",
    "option_e": "Recuperar-se automaticamente de falhas",
    "correct_answers": [
      "C",
      "E"
    ],
    "explanation_detailed": "O auto scaling para atender à demanda e a recuperação automatizada de falhas melhoram diretamente a confiabilidade da carga de trabalho.",
    "incorrect_explanations": {
      "A": "Operações como código apoiam a excelência operacional mais diretamente.",
      "B": "A rastreabilidade se alinha com os pilares de excelência operacional e segurança.",
      "D": "A implantação global visa o desempenho; a confiabilidade requer redundância e recuperação."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-037",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço fornece métricas de utilização (por exemplo, porcentagem de unidades de computação em uso) para uma instância EC2?",
    "option_a": "AWS CloudTrail",
    "option_b": "AWS Config",
    "option_c": "Amazon CloudWatch",
    "option_d": "AWS Artifact",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O CloudWatch fornece métricas de desempenho como CPUUtilization e métricas personalizadas para instâncias EC2.",
    "incorrect_explanations": {
      "A": "O CloudTrail é para auditoria de API.",
      "B": "O Config registra o estado e as alterações da configuração.",
      "D": "O Artifact é um repositório de documentos de conformidade."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-038",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS ajuda a investigar problemas de conectividade entre instâncias EC2?",
    "option_a": "AWS Certificate Manager (ACM)",
    "option_b": "Gateway da internet",
    "option_c": "Logs de Fluxo da VPC",
    "option_d": "AWS CloudHSM",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Logs de Fluxo da VPC capturam metadados de tráfego para interfaces de rede para diagnosticar permissões/negações e alcançabilidade.",
    "incorrect_explanations": {
      "A": "O ACM gerencia certificados; ele não captura dados de fluxo.",
      "B": "Um gateway da internet é um componente de roteamento, não uma ferramenta de diagnóstico.",
      "D": "O CloudHSM fornece módulos criptográficos dedicados."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-039",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS oferece armazenamento de objetos altamente durável?",
    "option_a": "Amazon S3",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Amazon FSx",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O S3 fornece armazenamento de objetos altamente durável e escalável em várias instalações.",
    "incorrect_explanations": {
      "B": "O EFS é armazenamento de arquivos.",
      "C": "O EBS é armazenamento de blocos anexado ao EC2.",
      "D": "O FSx é armazenamento de arquivos gerenciado."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-040",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS permite uma conexão privada dedicada do local para a AWS?",
    "option_a": "AWS CloudHSM",
    "option_b": "AWS Direct Connect",
    "option_c": "AWS VPN",
    "option_d": "Amazon Connect",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Direct Connect fornece links de rede dedicados e privados para a AWS.",
    "incorrect_explanations": {
      "A": "O CloudHSM é para operações de chave, não conectividade.",
      "C": "A VPN usa a internet pública, não uma linha privada dedicada.",
      "D": "O Amazon Connect é uma solução de contact center."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-041",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para manter as instâncias EC2 altamente disponíveis apesar de um desastre natural regional, o que uma empresa deve fazer?",
    "option_a": "Executar todas as instâncias em uma única Zona de Disponibilidade",
    "option_b": "Implantar instâncias em várias Regiões da AWS",
    "option_c": "Usar vários locais de borda para computação",
    "option_d": "Usar o Amazon CloudFront com o EC2 como origem",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A implantação multi-regional fornece redundância geográfica para resistir a eventos regionais.",
    "incorrect_explanations": {
      "A": "Uma única Zona de Disponibilidade é um único ponto de falha.",
      "C": "Locais de borda hospedam caches de CDN, não computação geral do EC2.",
      "D": "O CloudFront acelera o conteúdo, não a alta disponibilidade da computação."
    }
  },
  {
    "id": "clf-c02-security_compliance-042",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é o método recomendado para proteger dados sensíveis em trânsito na AWS?",
    "option_a": "Usar o AWS Shield",
    "option_b": "Usar SSL/TLS",
    "option_c": "Usar o AWS WAF",
    "option_d": "Usar políticas de segurança do IAM",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Criptografe dados em trânsito usando o padrão da indústria SSL/TLS para garantir a confidencialidade e integridade entre os pontos de extremidade.",
    "incorrect_explanations": {
      "A": "O Shield protege contra DDoS; ele não criptografa o tráfego.",
      "C": "O WAF filtra solicitações HTTP; ele não criptografa o transporte.",
      "D": "As políticas do IAM controlam o acesso, não a criptografia de transporte."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-043",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que o Amazon RDS automatiza que beneficia os administradores de banco de dados?",
    "option_a": "Escrever consultas SQL",
    "option_b": "Design de esquema de banco de dados",
    "option_c": "Backups e recuperação de instância de banco de dados",
    "option_d": "Geração de relatórios de negócios",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O RDS automatiza backups, snapshots, aplicação de patches e processos de recuperação gerenciados para os motores suportados.",
    "incorrect_explanations": {
      "A": "A autoria de consultas permanece uma tarefa do aplicativo/DBA.",
      "B": "O design do esquema é responsabilidade do cliente.",
      "D": "A geração de relatórios é inteligência de negócios/aplicativo, não um recurso do RDS."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-044",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS é melhor para distribuir tráfego entre várias instâncias do Amazon EC2?",
    "option_a": "Amazon EC2 Auto Scaling",
    "option_b": "AWS Direct Connect",
    "option_c": "Amazon Route 53",
    "option_d": "Elastic Load Balancer",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Elastic Load Balancing distribui automaticamente o tráfego de entrada de aplicativos entre vários alvos.",
    "incorrect_explanations": {
      "A": "O Auto Scaling ajusta a capacidade; não equilibra as solicitações.",
      "B": "O Direct Connect fornece conectividade privada, não distribuição de carga.",
      "C": "O Route 53 fornece DNS; não realiza balanceamento de carga por solicitação dentro de um grupo de destino."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-045",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é a função principal do AWS CloudFormation?",
    "option_a": "Monitorar o desempenho do aplicativo",
    "option_b": "Gerenciar a segurança da rede",
    "option_c": "Provisionar e gerenciar recursos da AWS",
    "option_d": "Automatizar apenas a implantação de aplicativos",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O CloudFormation provisiona e gerencia pilhas de recursos da AWS como código usando modelos declarativos.",
    "incorrect_explanations": {
      "A": "O monitoramento é feito por serviços como o CloudWatch.",
      "B": "O gerenciamento de segurança requer vários serviços; o CloudFormation define os recursos, mas não é um gerenciador de segurança.",
      "D": "Ele faz mais do que a implantação — ele provisiona a infraestrutura."
    }
  },
  {
    "id": "clf-c02-billing_pricing-046",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Como os custos são calculados para o Amazon S3?",
    "option_a": "Com base apenas no número de solicitações GET",
    "option_b": "Com base apenas no número de objetos armazenados",
    "option_c": "Com base no total de dados armazenados e transferência de dados",
    "option_d": "Com base apenas na duração do armazenamento",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O preço do S3 inclui a quantidade de armazenamento, a transferência de dados de saída e os recursos de solicitação/gerenciamento; os principais fatores de custo são o tamanho do armazenamento e a transferência de dados.",
    "incorrect_explanations": {
      "A": "As solicitações contribuem para o custo, mas não são a única base.",
      "B": "A contagem de objetos por si só não determina o custo; o tamanho importa.",
      "D": "A duração importa por meio do armazenamento mensal, mas não exclusivamente."
    }
  },
  {
    "id": "clf-c02-security_compliance-047",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS ajuda a detectar vulnerabilidades de segurança em aplicativos e infraestrutura?",
    "option_a": "AWS Inspector",
    "option_b": "AWS Shield",
    "option_c": "Amazon GuardDuty",
    "option_d": "AWS WAF",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon Inspector avalia automaticamente as imagens do EC2 e de contêineres em busca de vulnerabilidades e exposição de rede não intencional.",
    "incorrect_explanations": {
      "B": "O Shield se concentra na proteção contra DDoS, não na avaliação de vulnerabilidades.",
      "C": "O GuardDuty detecta ameaças a partir da telemetria, não vulnerabilidades de software.",
      "D": "O WAF filtra o tráfego HTTP usando regras; não é um scanner de vulnerabilidades."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-048",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual descrição se encaixa no Amazon DynamoDB?",
    "option_a": "Banco de dados relacional",
    "option_b": "Banco de dados somente de documentos",
    "option_c": "Banco de dados NoSQL",
    "option_d": "Data warehouse",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O DynamoDB é um banco de dados NoSQL de chave-valor e documento totalmente gerenciado com desempenho de milissegundos de um dígito.",
    "incorrect_explanations": {
      "A": "Bancos de dados relacionais usam esquemas SQL; o DynamoDB é NoSQL.",
      "B": "O DynamoDB suporta os modelos de chave-valor e de documento, não apenas de documento.",
      "D": "Um data warehouse é colunar e analítico; o DynamoDB é NoSQL operacional."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-049",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que o AWS Lambda permite que os desenvolvedores façam?",
    "option_a": "Gerenciar instâncias do EC2",
    "option_b": "Executar código em resposta a gatilhos",
    "option_c": "Alocar IPs Elásticos automaticamente",
    "option_d": "Monitorar aplicativos em tempo real",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Lambda executa código sem servidores em resposta a eventos como uploads no S3, chamadas de API ou gatilhos agendados.",
    "incorrect_explanations": {
      "A": "Gerenciar o EC2 não é o propósito do Lambda.",
      "C": "A alocação de IP Elástico é uma função de rede do EC2.",
      "D": "O monitoramento é feito por serviços como o CloudWatch."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-050",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é o principal propósito do Amazon S3?",
    "option_a": "Executar funções sem servidor",
    "option_b": "Armazenamento de objetos escalável",
    "option_c": "Hospedar aplicações web",
    "option_d": "Processar big data em escala",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon S3 oferece armazenamento de objetos altamente durável, altamente disponível e escalável para praticamente qualquer quantidade de dados.",
    "incorrect_explanations": {
      "A": "Funções sem servidor são executadas pelo AWS Lambda.",
      "C": "Aplicações web podem hospedar ativos estáticos no S3, mas seu principal propósito é o armazenamento.",
      "D": "O processamento de big data é feito por serviços como EMR ou Glue."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-051",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que é o AWS Direct Connect?",
    "option_a": "Um serviço para conectar redes locais à AWS",
    "option_b": "Uma ferramenta para transferências de arquivos grandes",
    "option_c": "Um serviço de mensagens instantâneas",
    "option_d": "Um sistema de gerenciamento de banco de dados",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Direct Connect fornece conectividade de rede privada e dedicada do local para a AWS com largura de banda e latência consistentes.",
    "incorrect_explanations": {
      "B": "Ferramentas de transferência de dados não fornecem circuitos de rede dedicados.",
      "C": "Não é uma plataforma de mensagens.",
      "D": "Não está relacionado ao gerenciamento de banco de dados."
    }
  },
  {
    "id": "clf-c02-security_compliance-052",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS um engenheiro de nuvem deve usar para visualizar chamadas de API feitas aos serviços da AWS?",
    "option_a": "Amazon CloudWatch",
    "option_b": "AWS CloudTrail",
    "option_c": "AWS Config",
    "option_d": "AWS Artifact",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS CloudTrail registra e expõe a atividade da API em todos os serviços da AWS, permitindo auditoria e investigação.",
    "incorrect_explanations": {
      "A": "O CloudWatch se concentra em métricas, logs e alarmes, não em trilhas de auditoria de API.",
      "C": "O AWS Config rastreia o histórico de configuração e a conformidade, não as chamadas de API brutas.",
      "D": "O AWS Artifact fornece relatórios e acordos de conformidade, não logs de API."
    }
  },
  {
    "id": "clf-c02-security_compliance-053",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Como um usuário da AWS pode realizar avaliações de segurança aprovadas em instâncias do Amazon EC2, gateways NAT e Elastic Load Balancers?",
    "option_a": "Inundar um alvo com solicitações",
    "option_b": "Usar o Amazon Inspector",
    "option_c": "Realizar testes de penetração ad-hoc sem aprovação",
    "option_d": "Usar o AWS Service Health Dashboard",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon Inspector fornece avaliações de segurança automatizadas e aprovadas pela AWS que apresentam descobertas priorizadas para o EC2 e outros recursos.",
    "incorrect_explanations": {
      "A": "A inundação de tráfego é um comportamento de negação de serviço e não um método de avaliação aprovado.",
      "C": "Os testes de penetração exigem adesão às políticas da AWS e não são amplamente permitidos ad-hoc.",
      "D": "O Service Health Dashboard relata o status do serviço da AWS, não as descobertas de segurança."
    }
  },
  {
    "id": "clf-c02-billing_pricing-054",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais fatores afetam os custos da nuvem AWS? (Selecione DOIS)",
    "option_a": "O número de funções do AWS Lambda não utilizadas",
    "option_b": "O número de buckets do Amazon S3 configurados",
    "option_c": "Transferência de dados de entrada sem aceleração",
    "option_d": "Transferência de dados de saída sem aceleração",
    "option_e": "Recursos de computação atualmente em uso",
    "correct_answers": [
      "D",
      "E"
    ],
    "explanation_detailed": "A transferência de dados de saída é faturável, e a computação consumida ativamente gera custo; funções não utilizadas ou a contagem de buckets por si só não geram.",
    "incorrect_explanations": {
      "A": "Ter funções do Lambda não utilizadas não incorre em cobranças de computação por si só.",
      "B": "Você não é cobrado por bucket; os custos estão relacionados a dados armazenados, solicitações e transferência.",
      "C": "A transferência de dados de entrada geralmente é gratuita para a maioria dos serviços."
    }
  },
  {
    "id": "clf-c02-billing_pricing-055",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é um princípio de eficiência de custos na AWS?",
    "option_a": "Dimensionar corretamente os serviços com base nas necessidades de capacidade",
    "option_b": "Usar o Console de Faturamento apenas para visualizar extratos mensais",
    "option_c": "Usar o AWS Organizations apenas para combinar faturas",
    "option_d": "Marcar cada recurso, independentemente do uso",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O dimensionamento correto corresponde ao tipo e tamanho do recurso à demanda real para evitar super ou subprovisionamento.",
    "incorrect_explanations": {
      "B": "Visualizar extratos não otimiza os gastos por si só.",
      "C": "O faturamento consolidado ajuda na visibilidade, mas não é em si um princípio de eficiência de custos.",
      "D": "A marcação auxilia na alocação e governança; não é uma ação direta de eficiência se não for direcionada."
    }
  },
  {
    "id": "clf-c02-security_compliance-056",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Os administradores devem agrupar usuários e aplicar permissões ao grupo. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS Organizations",
    "option_b": "Grupos de Recursos",
    "option_c": "Marcação de recursos",
    "option_d": "AWS Identity and Access Management (IAM)",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O IAM permite a criação de usuários e grupos e a anexação de políticas que definem permissões.",
    "incorrect_explanations": {
      "A": "O Organizations gerencia várias contas da AWS e políticas no nível da conta.",
      "B": "Os Grupos de Recursos organizam recursos para gerenciamento, não permissões de identidade.",
      "C": "As tags anotam os recursos, mas não concedem acesso por si mesmas."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-057",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa colocar duas instâncias do Amazon EC2 em data centers separados com latência mínima entre eles. Como isso deve ser alcançado?",
    "option_a": "Colocar as instâncias em duas Regiões da AWS separadas conectadas por emparelhamento de VPC",
    "option_b": "Colocar as instâncias em duas Zonas de Disponibilidade separadas dentro da mesma Região",
    "option_c": "Colocar uma instância no local e a outra em uma Região da AWS conectada via VPN",
    "option_d": "Colocar ambas as instâncias em um grupo de posicionamento para largura de banda dedicada",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Zonas de Disponibilidade separadas dentro de uma Região são data centers distintos conectados por rede de alta largura de banda e baixa latência.",
    "incorrect_explanations": {
      "A": "A latência inter-regional é maior do que os links de AZ intra-regionais.",
      "C": "Os links de VPN híbridos introduzem latência e complexidade adicionais.",
      "D": "Os grupos de posicionamento são para instâncias co-localizadas, não para separação entre data centers."
    }
  },
  {
    "id": "clf-c02-security_compliance-058",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um engenheiro de segurança precisa de uma solução AWS de inquilino único para criar, controlar e gerenciar chaves criptográficas para requisitos regulatórios. Qual serviço se encaixa?",
    "option_a": "AWS Key Management Service (AWS KMS)",
    "option_b": "AWS Certificate Manager (ACM)",
    "option_c": "AWS CloudHSM",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS CloudHSM fornece módulos de segurança de hardware dedicados e de inquilino único que você controla para geração e armazenamento de chaves.",
    "incorrect_explanations": {
      "A": "O KMS é um serviço gerenciado multi-inquilino; as chaves gerenciadas pelo cliente não são hospedadas em HSMs dedicados que você controla.",
      "B": "O ACM gerencia certificados, não armazenamentos de chaves gerais sob controle do cliente.",
      "D": "O Systems Manager lida com operações e automação, não com a custódia de chaves criptográficas."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-059",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer que os usuários façam login em um aplicativo usando suas identidades sociais, de e-mail ou de e-commerce. Qual serviço da AWS fornece isso?",
    "option_a": "AWS IAM Identity Center (AWS Single Sign-On)",
    "option_b": "AWS Config",
    "option_c": "Amazon Cognito",
    "option_d": "AWS Identity and Access Management (IAM)",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon Cognito suporta pools de usuários e federação com provedores de identidade sociais e OIDC/SAML para aplicativos web e móveis.",
    "incorrect_explanations": {
      "A": "O IAM Identity Center visa o SSO da força de trabalho para a AWS e SaaS, não o login de consumidor público em seu aplicativo.",
      "B": "O AWS Config rastreia a conformidade da configuração, não a autenticação.",
      "D": "O IAM gerencia identidades e funções da AWS, não o login de usuário no nível do aplicativo."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-060",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é o benefício da nuvem AWS que melhora o tempo de lançamento no mercado?",
    "option_a": "Velocidade de implantação reduzida",
    "option_b": "Segurança de aplicação aumentada",
    "option_c": "Agilidade de negócios aumentada",
    "option_d": "Capacidades de backup aprimoradas",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O provisionamento sob demanda e os serviços gerenciados permitem iteração e lançamento mais rápidos, aumentando a agilidade dos negócios.",
    "incorrect_explanations": {
      "A": "A nuvem acelera, não desacelera, as implantações.",
      "B": "A segurança pode melhorar, mas não é o principal impulsionador do tempo de lançamento no mercado.",
      "D": "Os backups são um benefício, mas não impulsionam diretamente lançamentos mais rápidos."
    }
  },
  {
    "id": "clf-c02-billing_pricing-061",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual benefício está incluído no plano AWS Enterprise Support?",
    "option_a": "Serviços de implementação de parceiros APN gratuitos",
    "option_b": "Um Gerente de Contas Técnico (TAM) da AWS designado",
    "option_c": "Engenheiros da AWS no local por padrão",
    "option_d": "Conformidade gerenciada como código via AWS Config",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Enterprise Support inclui orientação no estilo concierge com um TAM designado para impulsionar os resultados.",
    "incorrect_explanations": {
      "A": "Os serviços de parceiros APN são engajamentos separados.",
      "C": "A engenharia no local não é um direito padrão do Enterprise Support.",
      "D": "O AWS Config é um serviço; a AWS não gerencia sua conformidade como código por padrão."
    }
  },
  {
    "id": "clf-c02-billing_pricing-062",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer rastrear os custos dos serviços da AWS e receber alertas quando os custos previstos atingirem um limite específico. Qual serviço fornece isso?",
    "option_a": "AWS Budgets",
    "option_b": "AWS Cost Explorer",
    "option_c": "Savings Plans",
    "option_d": "AWS Billing Conductor",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Budgets permite que você defina orçamentos personalizados e receba alertas sobre gastos ou uso real ou previsto.",
    "incorrect_explanations": {
      "B": "O Cost Explorer analisa os gastos; os alertas são acionados pelo Budgets.",
      "C": "Os Savings Plans são descontos baseados em compromisso, não ferramentas de alerta.",
      "D": "O Billing Conductor se concentra em construções de faturamento personalizadas para organizações, não em alertas de orçamento."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-063",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual pilar do AWS Well-Architected foca no retorno sobre o investimento ao migrar para a AWS?",
    "option_a": "Sustentabilidade",
    "option_b": "Otimização de Custos",
    "option_c": "Excelência Operacional",
    "option_d": "Confiabilidade",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O pilar de Otimização de Custos visa maximizar o valor do negócio enquanto minimiza os custos por meio de dimensionamento correto, elasticidade e modelos de preços.",
    "incorrect_explanations": {
      "A": "A Sustentabilidade foca no impacto ambiental e na eficiência.",
      "C": "A Excelência Operacional diz respeito a operações, runbooks e melhoria contínua.",
      "D": "A Confiabilidade aborda a recuperação e a tolerância a falhas."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-064",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual pilar do Well-Architected foca em executar cargas de trabalho de forma eficaz, obter insights operacionais e melhoria contínua?",
    "option_a": "Otimização de Custos",
    "option_b": "Confiabilidade",
    "option_c": "Excelência Operacional",
    "option_d": "Eficiência de Desempenho",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "A Excelência Operacional enfatiza operações eficazes, observabilidade e melhoria iterativa de processos.",
    "incorrect_explanations": {
      "A": "A Otimização de Custos foca em gastos e valor.",
      "B": "A Confiabilidade enfatiza a tolerância a falhas e a recuperação.",
      "D": "A Eficiência de Desempenho foca na seleção e escalonamento de recursos."
    }
  },
  {
    "id": "clf-c02-security_compliance-065",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é uma característica do usuário root da conta AWS?",
    "option_a": "Apenas o usuário root pode ser configurado com MFA",
    "option_b": "Apenas o usuário root pode acessar o Console de Gerenciamento da AWS",
    "option_c": "O usuário root é a primeira identidade de login criada com uma nova conta AWS",
    "option_d": "A senha do usuário root não pode ser alterada",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O usuário root é criado com a conta e tem permissões completas; a melhor prática é protegê-lo e usá-lo com moderação.",
    "incorrect_explanations": {
      "A": "O MFA pode ser ativado para outros usuários do IAM também.",
      "B": "Usuários e funções do IAM podem acessar o console com permissões.",
      "D": "As senhas do root podem ser alteradas pelo proprietário da conta."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-066",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais opções da AWS oferecem aprendizado com instrutor sobre segurança na nuvem? (Selecione DOIS)",
    "option_a": "AWS Trusted Advisor",
    "option_b": "AWS Online Tech Talks",
    "option_c": "AWS Blog",
    "option_d": "Fóruns da AWS",
    "option_e": "Treinamento em Sala de Aula da AWS",
    "correct_answers": [
      "B",
      "E"
    ],
    "explanation_detailed": "As Palestras Técnicas Online da AWS e o Treinamento em Sala de Aula oferecem sessões guiadas ou com instrutor sobre tópicos que incluem segurança.",
    "incorrect_explanations": {
      "A": "O Trusted Advisor é uma ferramenta de recomendação, não treinamento.",
      "C": "O blog fornece artigos, não instrução com instrutor.",
      "D": "Os fóruns são discussões da comunidade, não sessões com instrutor."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-067",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS implementa um modelo de mensagens de publicação/assinatura (publish/subscribe)?",
    "option_a": "AWS Lambda",
    "option_b": "Amazon Simple Notification Service (Amazon SNS)",
    "option_c": "Amazon CloudWatch",
    "option_d": "AWS CloudFormation",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon SNS fornece mensagens pub/sub totalmente gerenciadas com tópicos e assinaturas.",
    "incorrect_explanations": {
      "A": "O Lambda executa código; não é um broker pub/sub.",
      "C": "O CloudWatch é para monitoramento e eventos, não para distribuição geral pub/sub.",
      "D": "O CloudFormation provisiona infraestrutura como código."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-068",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais são as vantagens ao mover uma carga de trabalho de produção do local para a AWS? (Selecione DOIS)",
    "option_a": "A AWS treina a equipe da empresa em todos os serviços da AWS gratuitamente",
    "option_b": "A AWS gerencia toda a segurança na nuvem",
    "option_c": "Suporte gratuito de Gerentes de Contas Técnicos (TAMs)",
    "option_d": "Alta disponibilidade",
    "option_e": "Economias de escala",
    "correct_answers": [
      "D",
      "E"
    ],
    "explanation_detailed": "A pegada global da AWS permite alta disponibilidade, e a demanda agregada gera economias de escala que reduzem os custos variáveis.",
    "incorrect_explanations": {
      "A": "As ofertas de treinamento são separadas e podem ser pagas.",
      "B": "A segurança é compartilhada; os clientes protegem suas cargas de trabalho.",
      "C": "O suporte de TAMs do Enterprise não é gratuito por padrão."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-069",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "A implantação de uma aplicação em várias Regiões da AWS com failover automático aborda principalmente qual conceito de nuvem?",
    "option_a": "Segurança",
    "option_b": "Confiabilidade",
    "option_c": "Escalabilidade",
    "option_d": "Otimização de custos",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Arquiteturas multi-regionais com failover aumentam a tolerância a falhas e a disponibilidade, aspectos chave da confiabilidade.",
    "incorrect_explanations": {
      "A": "A segurança se preocupa com confidencialidade, integridade e controle de acesso.",
      "C": "A escalabilidade visa lidar com o crescimento, não o failover entre Regiões.",
      "D": "A otimização de custos não é o objetivo principal aqui."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-070",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é o benefício de desacoplar uma arquitetura de nuvem AWS?",
    "option_a": "Latência reduzida",
    "option_b": "Capacidade de atualizar componentes de forma independente",
    "option_c": "Custos mais baixos em todos os casos",
    "option_d": "Menos componentes para gerenciar",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O acoplamento fraco permite a implantação e evolução independentes de serviços, reduzindo o raio de impacto e permitindo agilidade.",
    "incorrect_explanations": {
      "A": "O desacoplamento pode introduzir saltos de mensagens e não reduz inerentemente a latência.",
      "C": "Os custos dependem do design; o desacoplamento nem sempre é mais barato.",
      "D": "O desacoplamento pode aumentar a contagem de componentes (por exemplo, filas, tópicos)."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-071",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma nova aplicação é executada no Amazon EC2 e exigirá mais instâncias à medida que a carga aumentar. Qual serviço da AWS lança o número necessário de instâncias?",
    "option_a": "Elastic Load Balancing",
    "option_b": "Amazon EC2 Auto Scaling",
    "option_c": "AWS App2Container (A2C)",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon EC2 Auto Scaling adiciona ou remove instâncias automaticamente com base em políticas e demanda.",
    "incorrect_explanations": {
      "A": "O ELB distribui o tráfego, mas não escala a contagem de instâncias.",
      "C": "O App2Container ajuda a containerizar aplicativos; não escala frotas de EC2.",
      "D": "O Systems Manager lida com operações e automação, não grupos de auto scaling."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-072",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais serviços ou recursos da AWS permitem a notação de bloco CIDR ao especificar faixas de IP? (Selecione DOIS)",
    "option_a": "Grupos de segurança",
    "option_b": "Imagem de Máquina da Amazon (AMI)",
    "option_c": "Lista de controle de acesso à rede (ACL de rede)",
    "option_d": "AWS Budgets",
    "option_e": "Amazon Elastic Block Store (Amazon EBS)",
    "correct_answers": [
      "A",
      "C"
    ],
    "explanation_detailed": "Grupos de segurança e ACLs de rede aceitam blocos CIDR para definir faixas de IP permitidas ou negadas.",
    "incorrect_explanations": {
      "B": "AMIs são modelos de instância e não usam entradas CIDR.",
      "D": "O Budgets é para rastreamento de custos, não regras de rede.",
      "E": "O EBS fornece armazenamento de blocos e não aceita faixas CIDR."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-073",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece um banco de dados NoSQL gerenciado na Nuvem AWS?",
    "option_a": "Amazon Aurora",
    "option_b": "Amazon DynamoDB",
    "option_c": "Amazon RDS",
    "option_d": "Amazon Redshift",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon DynamoDB é um banco de dados NoSQL de chave-valor e documento totalmente gerenciado com escalabilidade perfeita.",
    "incorrect_explanations": {
      "A": "O Aurora é um banco de dados relacional.",
      "C": "O RDS gerencia motores relacionais, não NoSQL.",
      "D": "O Redshift é um data warehouse colunar."
    }
  },
  {
    "id": "clf-c02-security_compliance-074",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS pode identificar grupos de segurança que permitem tráfego SSH de entrada irrestrito?",
    "option_a": "Amazon Cognito",
    "option_b": "AWS Shield",
    "option_c": "Amazon Macie",
    "option_d": "AWS Trusted Advisor",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "As verificações de segurança do Trusted Advisor sinalizam grupos de segurança com regras excessivamente permissivas, como 0.0.0.0/0 na porta 22.",
    "incorrect_explanations": {
      "A": "O Cognito gerencia identidades de aplicativos, não a postura de segurança da rede.",
      "B": "O Shield fornece proteção contra DDoS.",
      "C": "O Macie descobre dados sensíveis; não audita as regras do grupo de segurança."
    }
  },
  {
    "id": "clf-c02-security_compliance-075",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa deseja um portal de usuário para acessar contas AWS atribuídas e aplicativos SaaS de terceiros com gerenciamento de permissões centralizado. Qual serviço deve ser usado?",
    "option_a": "Amazon Cognito",
    "option_b": "AWS IAM Identity Center (AWS Single Sign-On)",
    "option_c": "AWS Identity and Access Management (IAM)",
    "option_d": "AWS Directory Service for Microsoft Active Directory",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O IAM Identity Center fornece SSO para a força de trabalho e gerenciamento de acesso centralizado para várias contas AWS e aplicativos SaaS.",
    "incorrect_explanations": {
      "A": "O Cognito visa usuários de consumidores/aplicativos em vez de SSO de força de trabalho para AWS e SaaS.",
      "C": "O IAM gerencia permissões dentro de uma única conta; falta-lhe recursos de portal de usuário SSO.",
      "D": "O Directory Service fornece AD gerenciado, mas não a experiência completa do portal SSO."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-076",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS é um serviço web de DNS altamente disponível e escalável?",
    "option_a": "Amazon VPC",
    "option_b": "Amazon CloudFront",
    "option_c": "Amazon Route 53",
    "option_d": "Amazon Connect",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon Route 53 fornece DNS autoritativo com verificações de saúde, políticas de tráfego e registro de domínio.",
    "incorrect_explanations": {
      "A": "A VPC fornece rede isolada, não DNS como um serviço gerenciado.",
      "B": "O CloudFront é uma CDN, não DNS.",
      "D": "O Amazon Connect é um serviço de contact center."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-077",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é a quantidade total de armazenamento oferecida pelo Amazon S3?",
    "option_a": "100 MB",
    "option_b": "5 GB",
    "option_c": "5 TB",
    "option_d": "Ilimitado",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O S3 escala sem limites práticos de dados totais armazenados; objetos individuais podem ter até 5 TB.",
    "incorrect_explanations": {
      "A": "O armazenamento do S3 não é limitado a 100 MB.",
      "B": "5 GB está muito abaixo das capacidades do S3.",
      "C": "5 TB é o tamanho máximo por objeto, não a capacidade total."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-078",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma grande empresa precisa manter o hardware no local, mas quer usar o mesmo plano de controle e serviços que na AWS. Qual serviço deve usar?",
    "option_a": "AWS Device Farm",
    "option_b": "AWS Fargate",
    "option_c": "AWS Outposts",
    "option_d": "AWS Ground Station",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS Outposts estende a infraestrutura, serviços e APIs nativas da AWS para ambientes locais.",
    "incorrect_explanations": {
      "A": "O Device Farm testa aplicativos em dispositivos reais; não está relacionado à infraestrutura híbrida.",
      "B": "O Fargate executa contêineres em data centers da AWS, não em hardware local.",
      "D": "O Ground Station é para comunicações via satélite."
    }
  },
  {
    "id": "clf-c02-security_compliance-079",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais são as responsabilidades do cliente ao usar o AWS Lambda? (Selecione DOIS)",
    "option_a": "Segurança dentro do código",
    "option_b": "Seleção de recursos de CPU",
    "option_c": "Aplicação de patches no sistema operacional",
    "option_d": "Escrever e atualizar o código",
    "option_e": "Segurança da infraestrutura subjacente",
    "correct_answers": [
      "A",
      "D"
    ],
    "explanation_detailed": "Os clientes protegem e mantêm o código e a lógica de seus aplicativos; a AWS gerencia os servidores, o SO e a infraestrutura de tempo de execução.",
    "incorrect_explanations": {
      "B": "A seleção de CPU é abstraída; a escolha da memória governa a alocação de computação.",
      "C": "A AWS aplica patches no SO no serviço Lambda.",
      "E": "A AWS é responsável pela segurança da infraestrutura."
    }
  },
  {
    "id": "clf-c02-security_compliance-080",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Sob o modelo de responsabilidade compartilhada da AWS, quais são as responsabilidades do cliente? (Selecione DOIS)",
    "option_a": "Segurança física das instalações da AWS",
    "option_b": "Configuração de grupos de segurança",
    "option_c": "Criptografia de dados do cliente na AWS",
    "option_d": "Gerenciamento da infraestrutura do AWS Lambda",
    "option_e": "Gerenciamento da largura de banda da rede para cada Região da AWS",
    "correct_answers": [
      "B",
      "C"
    ],
    "explanation_detailed": "Os clientes configuram seus próprios controles de rede e determinam como e quando criptografar seus dados.",
    "incorrect_explanations": {
      "A": "A AWS fornece segurança física para seus data centers.",
      "D": "A AWS opera a infraestrutura do Lambda.",
      "E": "A capacidade da rede regional é gerenciada pela AWS."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-081",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece orientação em tempo real para provisionar recursos com base nas melhores práticas de segurança, otimização de custos e limites de serviço?",
    "option_a": "AWS Trusted Advisor",
    "option_b": "AWS Config",
    "option_c": "AWS Security Hub",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Trusted Advisor inspeciona seu ambiente e recomenda melhorias para custo, desempenho, segurança e limites.",
    "incorrect_explanations": {
      "B": "O Config avalia as configurações dos recursos, não verificações de melhores práticas abrangentes.",
      "C": "O Security Hub agrega descobertas de segurança; não é um conselheiro de provisionamento geral.",
      "D": "O Systems Manager lida com o gerenciamento e a automação de operações."
    }
  },
  {
    "id": "clf-c02-billing_pricing-082",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Vários projetos são executados no EC2 na mesma conta da AWS. A empresa quer rastrear os custos de infraestrutura por projeto com impacto mínimo e sem custo adicional. O que ela deve fazer?",
    "option_a": "Usar um tipo de instância EC2 diferente para cada projeto",
    "option_b": "Publicar métricas personalizadas do CloudWatch específicas do projeto",
    "option_c": "Implantar as instâncias EC2 de cada projeto em uma conta da AWS separada",
    "option_d": "Usar tags de alocação de custos com valores específicos do projeto",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "As tags de alocação de custos permitem que os relatórios de faturamento detalhem o uso e as cobranças por projeto sem alterar a arquitetura.",
    "incorrect_explanations": {
      "A": "O tipo de instância não direciona a atribuição de custos e pode prejudicar o ajuste de desempenho.",
      "B": "As métricas personalizadas adicionam custo e não estão vinculadas à categorização de faturamento.",
      "C": "Várias contas adicionam sobrecarga e podem não ser necessárias para o simples rastreamento de custos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-083",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS captura informações sobre o tráfego de rede de entrada e saída para uma instância do Amazon EC2?",
    "option_a": "Analisador de Alcançabilidade da VPC",
    "option_b": "Amazon Athena",
    "option_c": "Logs de Fluxo da VPC",
    "option_d": "AWS X-Ray",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Logs de Fluxo da VPC registram metadados de tráfego IP para ENIs, úteis para solução de problemas e análise.",
    "incorrect_explanations": {
      "A": "O Analisador de Alcançabilidade testa a viabilidade do caminho; não registra fluxos.",
      "B": "O Athena consulta dados no S3; não captura fluxos.",
      "D": "O X-Ray rastreia solicitações de aplicativos, não o tráfego da VPC."
    }
  },
  {
    "id": "clf-c02-security_compliance-084",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "De acordo com o modelo de responsabilidade compartilhada da AWS, quais são as responsabilidades do cliente? (Selecione DOIS)",
    "option_a": "Segurança física das instalações da AWS",
    "option_b": "Configuração de grupos de segurança",
    "option_c": "Criptografia de dados do cliente na AWS",
    "option_d": "Gerenciamento da infraestrutura do AWS Lambda",
    "option_e": "Gerenciamento da largura de banda da rede para cada Região da AWS",
    "correct_answers": [
      "B",
      "C"
    ],
    "explanation_detailed": "Os clientes controlam as regras de acesso à rede que criam e decidem como seus dados são protegidos em repouso e em trânsito.",
    "incorrect_explanations": {
      "A": "A AWS possui e protege as instalações físicas.",
      "D": "A AWS opera a plataforma Lambda.",
      "E": "A largura de banda regional é fornecida e gerenciada pela AWS."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-085",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS oferece orientação de melhores práticas em tempo real para segurança, custo, desempenho e limites de serviço?",
    "option_a": "AWS Trusted Advisor",
    "option_b": "AWS Config",
    "option_c": "AWS Security Hub",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Trusted Advisor avalia continuamente seu ambiente e sinaliza problemas em várias categorias.",
    "incorrect_explanations": {
      "B": "O Config foca na conformidade da configuração, não em orientação ampla.",
      "C": "O Security Hub agrega e normaliza as descobertas de segurança.",
      "D": "O Systems Manager é para gerenciamento e automação operacional."
    }
  },
  {
    "id": "clf-c02-billing_pricing-086",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa executa vários projetos no EC2 em uma única conta e deseja um rastreamento de custos separado por projeto com impacto mínimo e sem custo adicional. O que ela deve usar?",
    "option_a": "Diferentes tipos de instância EC2 por projeto",
    "option_b": "Métricas personalizadas do CloudWatch específicas do projeto",
    "option_c": "Contas da AWS separadas para cada projeto",
    "option_d": "Tags de alocação de custos com valores específicos do projeto",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "As tags de alocação de custos geram detalhamentos por projeto nos relatórios de faturamento sem alterações na arquitetura.",
    "incorrect_explanations": {
      "A": "O tipo de instância não mapeia claramente para projetos e pode dimensionar incorretamente os recursos.",
      "B": "As métricas personalizadas incorrem em cobranças e não afetam diretamente os relatórios de faturamento.",
      "C": "Contas separadas aumentam a sobrecarga e podem não ser necessárias."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-087",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS registra informações de tráfego de rede de entrada e saída para uma instância EC2?",
    "option_a": "Analisador de Alcançabilidade da VPC",
    "option_b": "Amazon Athena",
    "option_c": "Logs de Fluxo da VPC",
    "option_d": "AWS X-Ray",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Logs de Fluxo da VPC capturam metadados de tráfego IP para ENIs para analisar a conectividade e os padrões de acesso.",
    "incorrect_explanations": {
      "A": "O Analisador de Alcançabilidade verifica a alcançabilidade do caminho, não o registro de tráfego.",
      "B": "O Athena consulta dados armazenados no S3.",
      "D": "O X-Ray fornece rastreamento de aplicativos, não registro de fluxo de VPC."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-088",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa está migrando uma aplicação que usa um banco de dados Oracle para a AWS e não pode reescrever a aplicação. Qual serviço deve usar?",
    "option_a": "Amazon Athena",
    "option_b": "Amazon DynamoDB",
    "option_c": "Amazon RDS",
    "option_d": "Amazon DocumentDB (com compatibilidade com MongoDB)",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon RDS suporta Oracle como um motor gerenciado, permitindo o lift-and-shift sem reescrita de aplicativos.",
    "incorrect_explanations": {
      "A": "O Athena consulta dados no S3 e não é um banco de dados transacional.",
      "B": "O DynamoDB é NoSQL, incompatível com aplicativos Oracle SQL.",
      "D": "O DocumentDB visa cargas de trabalho compatíveis com MongoDB, não Oracle."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-089",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS é um modelo de instância do Amazon EC2 implantável, pré-empacotado com software e requisitos de segurança?",
    "option_a": "Volume do Amazon Elastic Block Store (Amazon EBS)",
    "option_b": "Modelo do AWS CloudFormation",
    "option_c": "Snapshot do Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Imagem de Máquina da Amazon (AMI)",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "Uma AMI contém as informações necessárias para lançar instâncias do EC2 com SO e software predefinidos.",
    "incorrect_explanations": {
      "A": "Os volumes do EBS fornecem armazenamento de blocos, não modelos de instância completos.",
      "B": "O CloudFormation define pilhas de recursos, não uma única imagem de instância.",
      "C": "Os snapshots do EBS são backups de volume, não modelos de instância inicializáveis."
    }
  },
  {
    "id": "clf-c02-billing_pricing-090",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS pode consolidar o faturamento de uma empresa com várias contas da AWS?",
    "option_a": "Relatório de Custos e Uso da AWS",
    "option_b": "AWS Organizations",
    "option_c": "AWS Cost Explorer",
    "option_d": "AWS Budgets",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Organizations permite o faturamento consolidado e a governança centralizada de contas.",
    "incorrect_explanations": {
      "A": "O Relatório de Custos e Uso fornece dados de uso detalhados, mas não consolida as contas.",
      "C": "O Cost Explorer analisa os gastos; não consolida o faturamento entre contas.",
      "D": "O Budgets alerta sobre os gastos, mas não unifica as faturas."
    }
  },
  {
    "id": "clf-c02-billing_pricing-091",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais serviços/recursos da AWS são fornecidos a todos os clientes sem custo adicional? (Selecione DOIS)",
    "option_a": "Amazon Aurora",
    "option_b": "Amazon VPC",
    "option_c": "Amazon SageMaker",
    "option_d": "AWS Identity and Access Management (IAM)",
    "option_e": "Amazon Polly",
    "correct_answers": [
      "B",
      "D"
    ],
    "explanation_detailed": "A VPC e o IAM estão disponíveis sem custo extra; você paga pelos recursos usados dentro deles.",
    "incorrect_explanations": {
      "A": "O Aurora é um serviço de banco de dados gerenciado pago.",
      "C": "O SageMaker é faturado pela computação, armazenamento e recursos usados.",
      "E": "O Polly cobra por caracteres sintetizados e recursos usados."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-092",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual descrição melhor define uma Região da AWS?",
    "option_a": "Uma área geográfica específica contendo vários locais isolados para alta disponibilidade",
    "option_b": "Um conjunto de data centers abrangendo vários países",
    "option_c": "Uma visão global do ambiente de nuvem de um usuário",
    "option_d": "Uma coleção de bancos de dados acessível apenas de uma geografia",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Uma Região da AWS é uma área geográfica composta por várias Zonas de Disponibilidade isoladas, conectadas por redes de baixa latência.",
    "incorrect_explanations": {
      "B": "As Regiões não abrangem vários países por definição.",
      "C": "Isso descreve a perspectiva da conta, não uma construção de Região.",
      "D": "As Regiões não são definidas como coleções de bancos de dados."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-093",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual pilar do Well-Architected inclui um princípio de design para medir a eficiência geral da carga de trabalho em termos de valor de negócio?",
    "option_a": "Excelência Operacional",
    "option_b": "Segurança",
    "option_c": "Confiabilidade",
    "option_d": "Otimização de Custos",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "A Excelência Operacional enfatiza a medição de resultados de negócios e o uso de loops de feedback para melhorar os processos.",
    "incorrect_explanations": {
      "B": "A Segurança foca na gestão de riscos e mecanismos de proteção.",
      "C": "A Confiabilidade visa a tolerância a falhas e a recuperação.",
      "D": "A Otimização de Custos foca na eficiência dos gastos, não nos KPIs operacionais."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-094",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Relatórios mensais são armazenados como arquivos CSV no Amazon S3. Um desenvolvedor quer executar consultas simples em todos os arquivos e produzir um resumo. Qual serviço deve ser usado?",
    "option_a": "Amazon S3 Select",
    "option_b": "Amazon Athena",
    "option_c": "Amazon Redshift",
    "option_d": "Amazon EC2",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon Athena fornece consultas SQL sem servidor diretamente contra dados no S3 sem infraestrutura para gerenciar.",
    "incorrect_explanations": {
      "A": "O S3 Select filtra dentro de um único objeto; não se destina a consultar muitos arquivos como um conjunto de dados.",
      "C": "O Redshift é um data warehouse gerenciado que requer provisionamento de cluster.",
      "D": "O EC2 exigiria a construção e o gerenciamento de sua própria pilha de consultas."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-095",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Ao projetar cargas de trabalho da AWS para permanecerem operacionais apesar das falhas dos componentes, qual é uma prática recomendada da AWS?",
    "option_a": "Executar apenas testes trimestrais de recuperação de desastres",
    "option_b": "Colocar o componente principal apenas em us-east-1",
    "option_c": "Projetar para failover automático para recursos saudáveis",
    "option_d": "Ajustar as cargas de trabalho em uma única instância do Amazon EC2",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O failover automático para recursos redundantes e saudáveis melhora a disponibilidade e a resiliência.",
    "incorrect_explanations": {
      "A": "Os testes ajudam, mas o design deve incluir mecanismos de failover.",
      "B": "A escolha da região por si só não garante a resiliência.",
      "D": "Projetos de instância única criam um único ponto de falha."
    }
  },
  {
    "id": "clf-c02-security_compliance-096",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer proteger informações, sistemas e ativos na AWS enquanto avalia e mitiga riscos. A qual pilar do Well-Architected isso se alinha?",
    "option_a": "Confiabilidade",
    "option_b": "Segurança",
    "option_c": "Excelência Operacional",
    "option_d": "Eficiência de Desempenho",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O pilar de Segurança abrange gerenciamento de identidade e acesso, proteção de dados, segurança de infraestrutura, detecção e resposta a incidentes.",
    "incorrect_explanations": {
      "A": "Confiabilidade é sobre tolerância a falhas e recuperação.",
      "C": "Excelência Operacional foca em operações e melhoria contínua.",
      "D": "Eficiência de Desempenho foca na seleção e escalonamento de recursos."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-097",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Durante eventos de escala, uma empresa quer permanecer dentro das cotas de serviço da AWS. O que deve ser usado? (Selecione DOIS)",
    "option_a": "Console do Service Quotas",
    "option_b": "AWS Trusted Advisor",
    "option_c": "AWS Systems Manager",
    "option_d": "AWS Shield",
    "option_e": "AWS Cost Explorer",
    "correct_answers": [
      "A",
      "B"
    ],
    "explanation_detailed": "O Service Quotas fornece visibilidade e solicitações de aumento; o Trusted Advisor alerta sobre a aproximação dos limites de serviço.",
    "incorrect_explanations": {
      "C": "O Systems Manager lida com tarefas de operações, não com o monitoramento de cotas.",
      "D": "O Shield mitiga ataques DDoS, não relacionado a cotas.",
      "E": "O Cost Explorer analisa os gastos, não os limites de serviço."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-098",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS é um banco de dados de chave-valor que fornece latência de milissegundos de um dígito em escala?",
    "option_a": "Amazon DynamoDB",
    "option_b": "Amazon Aurora",
    "option_c": "Amazon DocumentDB (com compatibilidade com MongoDB)",
    "option_d": "Amazon Neptune",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O DynamoDB é um banco de dados NoSQL de chave-valor e documento totalmente gerenciado, projetado para latência de sub-milissegundos a milissegundos de um dígito.",
    "incorrect_explanations": {
      "B": "O Aurora é relacional e otimizado para cargas de trabalho SQL.",
      "C": "O DocumentDB é um banco de dados de documentos compatível com as APIs do MongoDB.",
      "D": "O Neptune é um banco de dados de grafos."
    }
  },
  {
    "id": "clf-c02-billing_pricing-099",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual modelo de precificação da AWS permite que os usuários paguem com base nas necessidades atuais em vez de previsões?",
    "option_a": "AWS Budgets",
    "option_b": "Precificação pague-conforme-o-uso (pay-as-you-go)",
    "option_c": "Descontos por volume",
    "option_d": "Savings Plans",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O pague-conforme-o-uso cobra pelo que você realmente consome sem compromissos iniciais.",
    "incorrect_explanations": {
      "A": "O Budgets fornece alertas e rastreamento, não um modelo de precificação.",
      "C": "Os descontos por volume reduzem o preço unitário em uso mais alto, mas não são o modelo base.",
      "D": "Os Savings Plans exigem compromissos de uso para descontos."
    }
  },
  {
    "id": "clf-c02-billing_pricing-100",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS ajuda a gerenciar centralmente o faturamento e a permitir o acesso controlado a recursos em contas da AWS?",
    "option_a": "AWS Identity and Access Management (IAM)",
    "option_b": "AWS Organizations",
    "option_c": "AWS Cost Explorer",
    "option_d": "AWS Budgets",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Organizations fornece faturamento consolidado e gerenciamento baseado em políticas em várias contas.",
    "incorrect_explanations": {
      "A": "O IAM gerencia identidades dentro de uma única conta.",
      "C": "O Cost Explorer fornece análises de gastos; não gerencia o acesso a várias contas.",
      "D": "O Budgets alerta sobre gastos, mas não orquestra a governança da conta."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-101",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais DOIS são componentes de uma conexão VPN Site-to-Site da AWS? (Selecione DOIS)",
    "option_a": "AWS Storage Gateway",
    "option_b": "Gateway privado virtual",
    "option_c": "Gateway NAT",
    "option_d": "Gateway do cliente",
    "option_e": "Gateway da internet",
    "correct_answers": [
      "B",
      "D"
    ],
    "explanation_detailed": "Uma VPN Site-to-Site usa um gateway privado virtual no lado da AWS e um gateway do cliente na rede do cliente para estabelecer os túneis IPSec em uma VPC.",
    "incorrect_explanations": {
      "A": "O AWS Storage Gateway integra ambientes locais com armazenamento em nuvem; não faz parte dos componentes de uma VPN Site-to-Site.",
      "C": "Um gateway NAT fornece acesso de saída à internet para sub-redes privadas; não está relacionado aos pontos de extremidade do túnel VPN.",
      "E": "Um gateway da internet permite o roteamento da internet para uma VPC; não é necessário para terminar uma VPN IPSec."
    }
  },
  {
    "id": "clf-c02-security_compliance-102",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Sob o modelo de responsabilidade compartilhada da AWS, qual tarefa é responsabilidade do cliente?",
    "option_a": "Gerenciar sistemas operacionais convidados",
    "option_b": "Manter a configuração de dispositivos de infraestrutura",
    "option_c": "Gerenciar o sistema operacional do host e a camada de virtualização",
    "option_d": "Manter o software que alimenta as Zonas de Disponibilidade",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Os clientes são responsáveis pela segurança na nuvem, o que inclui a configuração e a aplicação de patches em sistemas operacionais convidados, aplicativos e proteções de dados.",
    "incorrect_explanations": {
      "B": "A AWS gerencia os dispositivos de infraestrutura que executam a nuvem.",
      "C": "A AWS gerencia o SO do host e a camada do hipervisor como parte da segurança da nuvem.",
      "D": "A AWS mantém o software e os sistemas que alimentam as Zonas de Disponibilidade."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-103",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa mover todas as equipes de desenvolvimento para um IDE baseado na nuvem. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS CodeBuild",
    "option_b": "AWS Cloud9",
    "option_c": "AWS OpsWorks",
    "option_d": "AWS Cloud Development Kit (AWS CDK)",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Cloud9 é um IDE baseado na nuvem que permite aos desenvolvedores escrever, executar e depurar código em um navegador.",
    "incorrect_explanations": {
      "A": "O CodeBuild compila, testa e empacota código; não é um IDE.",
      "C": "O OpsWorks gerencia a configuração usando Chef/Puppet; não é um IDE.",
      "D": "O AWS CDK define a infraestrutura como código; não é um IDE."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-104",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é um princípio de design recomendado do AWS Well-Architected Framework?",
    "option_a": "Reduzir o tempo de inatividade fazendo alterações de infraestrutura grandes e infrequentes",
    "option_b": "Investir tempo na configuração manual da infraestrutura",
    "option_c": "Aprender a melhorar com as falhas operacionais",
    "option_d": "Usar um design de aplicação monolítico para centralização",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O pilar de Excelência Operacional promove o aprendizado com eventos e falhas operacionais para impulsionar a melhoria contínua.",
    "incorrect_explanations": {
      "A": "Alterações frequentes, pequenas e reversíveis reduzem o risco em comparação com alterações grandes e infrequentes.",
      "B": "Automatize para reduzir o erro humano e aumentar a velocidade operacional.",
      "D": "Arquiteturas distribuídas e fracamente acopladas são preferíveis a monólitos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-105",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço de banco de dados da AWS fornece armazenamento de dados em memória?",
    "option_a": "Amazon DynamoDB",
    "option_b": "Amazon ElastiCache",
    "option_c": "Amazon RDS",
    "option_d": "Amazon Timestream",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon ElastiCache oferece armazenamentos de dados em memória gerenciados (Redis e Memcached) para latência de sub-milissegundos.",
    "incorrect_explanations": {
      "A": "O DynamoDB é um banco de dados NoSQL gerenciado com suporte de SSD, não um cache em memória.",
      "C": "O Amazon RDS é um serviço de banco de dados relacional gerenciado, não um cache em memória.",
      "D": "O Timestream é um banco de dados de séries temporais, não um cache em memória."
    }
  },
  {
    "id": "clf-c02-security_compliance-106",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS deve ser usado para armazenar credenciais de banco de dados com máxima segurança?",
    "option_a": "AWS Identity and Access Management (IAM)",
    "option_b": "AWS Secrets Manager",
    "option_c": "Amazon S3",
    "option_d": "AWS Key Management Service (AWS KMS)",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Secrets Manager armazena, rotaciona e recupera segredos com segurança, como credenciais de banco de dados e chaves de API.",
    "incorrect_explanations": {
      "A": "O IAM gerencia identidades e permissões; não é um serviço de armazenamento de segredos.",
      "C": "O S3 é armazenamento de objetos e requer controles adicionais para armazenar segredos com segurança.",
      "D": "O KMS gerencia chaves de criptografia; não armazena segredos de aplicativos."
    }
  },
  {
    "id": "clf-c02-security_compliance-107",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa atender aos requisitos do Setor de Cartões de Pagamento (PCI) e precisa de documentos de conformidade da AWS. Qual serviço fornece esses relatórios?",
    "option_a": "Amazon Cloud Directory",
    "option_b": "AWS Artifact",
    "option_c": "AWS Trusted Advisor",
    "option_d": "Amazon Inspector",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Artifact fornece acesso sob demanda a relatórios de conformidade, certificações e acordos da AWS, como o PCI DSS.",
    "incorrect_explanations": {
      "A": "O Amazon Cloud Directory é para construir diretórios nativos da nuvem, não para relatórios de conformidade.",
      "C": "O Trusted Advisor fornece verificações de melhores práticas, não relatórios formais de conformidade.",
      "D": "O Amazon Inspector avalia vulnerabilidades; não entrega documentos de conformidade."
    }
  },
  {
    "id": "clf-c02-security_compliance-108",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa gerenciar centralmente as políticas de segurança e consolidar o faturamento em várias contas da AWS. Qual serviço deve ser usado?",
    "option_a": "AWS Identity and Access Management (IAM)",
    "option_b": "AWS Organizations",
    "option_c": "AWS Resource Access Manager (AWS RAM)",
    "option_d": "AWS Config",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Organizations permite a governança centralizada com políticas de controle de serviço (SCPs) e faturamento consolidado em várias contas.",
    "incorrect_explanations": {
      "A": "O IAM gerencia identidades e permissões dentro de uma conta; não consolida o faturamento nem gerencia políticas de várias contas.",
      "C": "O AWS RAM compartilha recursos entre contas; não gerencia políticas ou faturamento.",
      "D": "O AWS Config registra alterações de configuração; não fornece faturamento consolidado ou SCPs."
    }
  },
  {
    "id": "clf-c02-security_compliance-109",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa executa uma aplicação web em um contêiner Docker no Amazon EC2. Qual tarefa é responsabilidade da AWS?",
    "option_a": "Escalar a aplicação web em contêiner",
    "option_b": "Provisionar ou agendar contêineres e mantê-los disponíveis",
    "option_c": "Realizar manutenção de hardware nas instalações da AWS que executam a Nuvem AWS",
    "option_d": "Gerenciar e aplicar patches no sistema operacional convidado",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Sob o modelo de responsabilidade compartilhada, a AWS protege e mantém a infraestrutura global e o hardware que executam a nuvem.",
    "incorrect_explanations": {
      "A": "Os clientes lidam com o escalonamento de aplicativos, a menos que usem serviços gerenciados configurados para isso.",
      "B": "A orquestração de contêineres é responsabilidade do cliente, a menos que se use orquestração gerenciada como ECS/EKS com a configuração adequada.",
      "D": "Os clientes gerenciam as atualizações do SO convidado em suas instâncias EC2."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-110",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Ao trazer suas próprias licenças vinculadas a soquetes, núcleos ou VMs para o Microsoft Windows na AWS, qual opção do Amazon EC2 é necessária?",
    "option_a": "Instâncias Spot",
    "option_b": "Instâncias Dedicadas",
    "option_c": "Hosts Dedicados",
    "option_d": "Instâncias Reservadas",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os Hosts Dedicados fornecem visibilidade e controle sobre o hardware do servidor físico para atender aos termos de licença baseados em soquetes, núcleos ou VMs.",
    "incorrect_explanations": {
      "A": "As Instâncias Spot são capacidade ociosa com preços interrompíveis; elas não abordam o licenciamento em nível de host.",
      "B": "As Instâncias Dedicadas são executadas em hardware dedicado a um cliente, mas não expõem controles de licenciamento em nível de host.",
      "D": "As Instâncias Reservadas são um benefício de preço, não uma alocação de hardware para conformidade com BYOL (Traga Sua Própria Licença)."
    }
  },
  {
    "id": "clf-c02-security_compliance-111",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece proteção contra ataques HTTP comuns para aplicações web voltadas para o público?",
    "option_a": "Grupos de segurança",
    "option_b": "ACLs de rede",
    "option_c": "AWS Shield Standard",
    "option_d": "AWS WAF",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS WAF é um firewall de aplicação web que permite criar regras para bloquear, permitir ou contar solicitações para mitigar ameaças como injeção de SQL e XSS.",
    "incorrect_explanations": {
      "A": "Os grupos de segurança atuam no nível da instância e não inspecionam o conteúdo das solicitações HTTP.",
      "B": "As ACLs de rede são firewalls de sub-rede sem estado e não fornecem filtragem na camada de aplicação.",
      "C": "O AWS Shield foca na proteção contra DDoS, não na filtragem granular de solicitações HTTP."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-112",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer implantar e gerenciar uma aplicação baseada em Docker na AWS. Qual serviço deve usar?",
    "option_a": "Um orquestrador Docker de código aberto no Amazon EC2",
    "option_b": "AWS AppSync",
    "option_c": "Amazon Elastic Container Registry (Amazon ECR)",
    "option_d": "Amazon Elastic Container Service (Amazon ECS)",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon ECS é um serviço de orquestração de contêineres totalmente gerenciado para executar, escalar e proteger contêineres Docker na AWS.",
    "incorrect_explanations": {
      "A": "Orquestradores autogerenciados aumentam a sobrecarga operacional em comparação com um serviço gerenciado.",
      "B": "O AppSync é um serviço GraphQL, não um orquestrador de contêineres.",
      "C": "O ECR é um registro de imagens de contêineres; não orquestra contêineres."
    }
  },
  {
    "id": "clf-c02-security_compliance-113",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um engenheiro de nuvem precisa baixar documentos de segurança e conformidade da AWS para uma próxima auditoria. Qual serviço os fornece?",
    "option_a": "AWS Trusted Advisor",
    "option_b": "AWS Artifact",
    "option_c": "AWS Well-Architected Tool",
    "option_d": "AWS Systems Manager",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Artifact oferece acesso auto-serviço a relatórios e acordos de conformidade da AWS necessários para auditorias.",
    "incorrect_explanations": {
      "A": "O Trusted Advisor fornece verificações de melhores práticas, não relatórios formais de conformidade.",
      "C": "O Well-Architected Tool é para revisões de design, não documentos de conformidade.",
      "D": "O Systems Manager gerencia a frota e a configuração, não relatórios de conformidade."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-114",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação armazena dados no Amazon S3 e tem uma função Lambda que processa os dados. A função deve ser invocada uma vez por dia em um horário específico. Qual serviço deve acioná-la?",
    "option_a": "AWS Managed Services (AMS)",
    "option_b": "AWS CodeStar",
    "option_c": "Amazon EventBridge",
    "option_d": "AWS Step Functions",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon EventBridge suporta expressões cron e de taxa para invocar alvos como o Lambda em um horário fixo.",
    "incorrect_explanations": {
      "A": "O AMS fornece gerenciamento operacional, não agendamento de eventos.",
      "B": "O CodeStar é para gerenciamento de projetos em ferramentas de desenvolvimento, não agendamento.",
      "D": "O Step Functions orquestra fluxos de trabalho, mas não fornece gatilhos baseados em tempo por si só."
    }
  },
  {
    "id": "clf-c02-security_compliance-115",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de um firewall no nível da sub-rede que controle o tráfego de entrada e saída em uma VPC. Qual opção atende a esse requisito?",
    "option_a": "Tabelas de rotas",
    "option_b": "Listas de controle de acesso à rede (ACLs de rede)",
    "option_c": "Grupos de segurança",
    "option_d": "Amazon GuardDuty",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "As ACLs de rede são firewalls sem estado aplicados no limite da sub-rede e filtram o tráfego de entrada e saída.",
    "incorrect_explanations": {
      "A": "As tabelas de rotas direcionam o tráfego; elas não o filtram.",
      "C": "Os grupos de segurança operam no nível da ENI da instância, não no nível da sub-rede.",
      "D": "O GuardDuty é um serviço de detecção de ameaças, não um filtro de tráfego."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-116",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa está migrando um banco de dados relacional para a AWS e quer minimizar a sobrecarga administrativa. Qual serviço deve escolher?",
    "option_a": "Amazon DynamoDB",
    "option_b": "Amazon EC2",
    "option_c": "Amazon Redshift",
    "option_d": "Amazon RDS",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon RDS é um serviço de banco de dados relacional totalmente gerenciado que lida com backups, aplicação de patches e manutenção.",
    "incorrect_explanations": {
      "A": "O DynamoDB é NoSQL, não um banco de dados relacional.",
      "B": "Executar um banco de dados no EC2 requer autogerenciamento completo.",
      "C": "O Redshift é um data warehouse otimizado para análise, não para cargas de trabalho OLTP."
    }
  },
  {
    "id": "clf-c02-billing_pricing-117",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "A análise do uso do Amazon EC2 para recomendar possíveis economias de custos é um exemplo de qual prática?",
    "option_a": "Escalonamento automático (auto scaling)",
    "option_b": "Dimensionamento correto (right sizing)",
    "option_c": "Balanceamento de carga (load balancing)",
    "option_d": "Alta disponibilidade (high availability)",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O dimensionamento correto corresponde aos tipos e tamanhos de instância às necessidades da carga de trabalho para otimizar custo e desempenho.",
    "incorrect_explanations": {
      "A": "O Auto Scaling ajusta a capacidade, mas não é a prática de análise em si.",
      "C": "O balanceamento de carga distribui o tráfego; não é uma prática de análise de custos.",
      "D": "A alta disponibilidade foca na resiliência, não na otimização de custos."
    }
  },
  {
    "id": "clf-c02-billing_pricing-118",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Uma empresa migrou cargas de trabalho para a AWS e quer avaliar se as instâncias EC2 importadas estão dimensionadas corretamente e são do melhor tipo. Quais DOIS serviços ajudam? (Selecione DOIS)",
    "option_a": "AWS Auto Scaling",
    "option_b": "AWS Control Tower",
    "option_c": "AWS Trusted Advisor",
    "option_d": "AWS Compute Optimizer",
    "option_e": "Amazon Forecast",
    "correct_answers": [
      "C",
      "D"
    ],
    "explanation_detailed": "O AWS Compute Optimizer analisa métricas de recursos para recomendar melhores tipos e tamanhos de instâncias EC2, e o Trusted Advisor sinaliza instâncias subutilizadas ou com custo ineficiente.",
    "incorrect_explanations": {
      "A": "O Auto Scaling altera a capacidade com base na demanda; não recomenda tipos de instância.",
      "B": "O Control Tower configura e governa ambientes de várias contas; não dimensiona instâncias.",
      "E": "O Amazon Forecast é para previsão de séries temporais, não para dimensionamento de EC2."
    }
  },
  {
    "id": "clf-c02-billing_pricing-119",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual plano de Suporte da AWS atribui um concierge à conta de uma empresa?",
    "option_a": "Suporte Básico da AWS",
    "option_b": "Suporte para Desenvolvedores da AWS",
    "option_c": "Suporte Empresarial da AWS",
    "option_d": "Suporte Enterprise da AWS",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Suporte Enterprise da AWS inclui uma equipe de concierge e um Gerente de Contas Técnico designado para orientação proativa.",
    "incorrect_explanations": {
      "A": "O Suporte Básico não inclui serviços de concierge.",
      "B": "O Suporte para Desenvolvedores fornece orientação para uso não produtivo, sem concierge.",
      "C": "O Suporte Empresarial oferece suporte técnico 24/7, mas sem equipe de concierge."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-120",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual vantagem da nuvem AWS ajuda a minimizar os custos por unidade?",
    "option_a": "Alta disponibilidade",
    "option_b": "Economias de escala",
    "option_c": "Alcance global",
    "option_d": "Agilidade",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Ao agregar a demanda de muitos clientes, a AWS alcança economias de escala e repassa custos por unidade mais baixos aos usuários.",
    "incorrect_explanations": {
      "A": "A alta disponibilidade aumenta a resiliência, não necessariamente os custos por unidade.",
      "C": "O alcance global diz respeito à presença regional, não diretamente ao custo unitário.",
      "D": "A agilidade acelera a entrega, mas não reduz inerentemente o custo por unidade."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-121",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual proposta de valor da AWS descreve o escalonamento da infraestrutura com base na demanda?",
    "option_a": "Velocidade de inovação",
    "option_b": "Elasticidade de recursos",
    "option_c": "Arquitetura desacoplada",
    "option_d": "Implantação global",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A elasticidade permite o provisionamento e desprovisionamento rápidos de recursos à medida que a demanda muda.",
    "incorrect_explanations": {
      "A": "A velocidade de inovação refere-se à experimentação e entrega rápidas.",
      "C": "A arquitetura desacoplada é uma prática de design, não a capacidade de escalar sob demanda.",
      "D": "A implantação global refere-se à presença multi-regional, não ao escalonamento elástico."
    }
  },
  {
    "id": "clf-c02-billing_pricing-122",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso está disponível para clientes com o plano de Suporte Empresarial da AWS?",
    "option_a": "Concierge de Suporte da AWS",
    "option_b": "Equipe de Resposta a DDoS da AWS (DRT)",
    "option_c": "Um Gerente de Contas Técnico (TAM) designado",
    "option_d": "API de Saúde da AWS",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Suporte Empresarial inclui acesso à API de Saúde da AWS para visibilidade programática de eventos de saúde; concierge e um TAM designado são benefícios do Enterprise.",
    "incorrect_explanations": {
      "A": "O suporte de concierge está incluído no Suporte Enterprise.",
      "B": "O acesso ao DRT está associado ao Shield Advanced, não apenas ao Suporte Empresarial.",
      "C": "Um TAM designado é fornecido no Suporte Enterprise."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-123",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Estudantes com laptops de baixo custo precisam acessar uma aplicação intensiva em hardware. Qual serviço da AWS deve entregar a aplicação?",
    "option_a": "Amazon AppStream 2.0",
    "option_b": "AWS AppSync",
    "option_c": "Amazon WorkLink",
    "option_d": "AWS Elastic Beanstalk",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon AppStream 2.0 transmite aplicações de desktop da AWS para qualquer dispositivo com um navegador, descarregando a computação pesada para a nuvem.",
    "incorrect_explanations": {
      "B": "O AppSync fornece APIs GraphQL; não transmite aplicativos de desktop.",
      "C": "O WorkLink fornecia acesso seguro a sites internos; não transmite aplicativos.",
      "D": "O Elastic Beanstalk implanta aplicativos e serviços web; não transmite aplicativos de desktop."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-124",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O que é uma Zona de Disponibilidade (AZ)?",
    "option_a": "Um lugar para implantar serviços da AWS onde não existe uma Região",
    "option_b": "Um ou mais data centers discretos com energia, rede e conectividade redundantes",
    "option_c": "Um ou mais clusters de servidores para novas cargas de trabalho",
    "option_d": "Uma rede de entrega de conteúdo global para dados, vídeos, aplicativos e APIs seguros",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Uma AZ é uma localização fisicamente separada dentro de uma Região da AWS, projetada para isolamento de falhas e conectada por redes de baixa latência.",
    "incorrect_explanations": {
      "A": "As AZs existem dentro das Regiões, não fora delas.",
      "C": "Esta descrição é vaga e não é a definição formal de uma AZ.",
      "D": "Uma CDN descreve o Amazon CloudFront, não uma AZ."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-125",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais DOIS são princípios de design de confiabilidade na Nuvem AWS? (Selecione DOIS)",
    "option_a": "Construir arquiteturas com recursos fortemente acoplados",
    "option_b": "Usar o AWS Trusted Advisor para atender às melhores práticas de segurança",
    "option_c": "Usar automação para se recuperar de falhas automaticamente",
    "option_d": "Dimensionar corretamente as instâncias do Amazon EC2 para garantir o desempenho ideal",
    "option_e": "Injetar falhas para testar os processos de recuperação",
    "correct_answers": [
      "C",
      "E"
    ],
    "explanation_detailed": "A recuperação automatizada reduz o MTTR e o erro humano, e testar falhas deliberadamente valida os mecanismos de recuperação para melhorar a resiliência.",
    "incorrect_explanations": {
      "A": "O acoplamento forte reduz a resiliência; sistemas fracamente acoplados são preferíveis.",
      "B": "O Trusted Advisor ajuda, mas não é em si um princípio de design de confiabilidade.",
      "D": "O dimensionamento correto é uma técnica de otimização de custo/desempenho, não um princípio de confiabilidade."
    }
  },
  {
    "id": "clf-c02-security_compliance-126",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Quem é responsável pelo descomissionamento de dispositivos de armazenamento em fim de vida usados para hospedar dados na AWS?",
    "option_a": "Cliente",
    "option_b": "AWS",
    "option_c": "Usuário root da conta",
    "option_d": "Equipe de auditoria externa",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A AWS é responsável pelo descomissionamento seguro da mídia como parte da proteção da infraestrutura global da AWS.",
    "incorrect_explanations": {
      "A": "Os clientes não manuseiam mídia física dentro dos data centers da AWS.",
      "C": "O usuário root é uma identidade da conta, não uma parte que gerencia o hardware da AWS.",
      "D": "Os auditores validam processos; eles não realizam o descomissionamento."
    }
  },
  {
    "id": "clf-c02-security_compliance-127",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS exige que o cliente aplique patches no sistema operacional convidado?",
    "option_a": "AWS Lambda",
    "option_b": "Amazon OpenSearch Service",
    "option_c": "Amazon EC2",
    "option_d": "Amazon ElastiCache",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Com o Amazon EC2, os clientes gerenciam e aplicam patches no sistema operacional convidado e no software instalado.",
    "incorrect_explanations": {
      "A": "O Lambda abstrai os servidores e o gerenciamento do SO dos clientes.",
      "B": "O Amazon OpenSearch Service gerencia as instâncias subjacentes e o SO para o domínio.",
      "D": "O ElastiCache gerencia os nós e a aplicação de patches para os motores de cache."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-128",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual perspectiva inclui capacidades fundamentais no AWS Cloud Adoption Framework (AWS CAF)?",
    "option_a": "Sustentabilidade",
    "option_b": "Operações",
    "option_c": "Eficiência de Desempenho",
    "option_d": "Confiabilidade",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A perspectiva de Operações no AWS CAF foca em operar, monitorar e suportar cargas de trabalho e inclui capacidades fundamentais.",
    "incorrect_explanations": {
      "A": "Sustentabilidade é um pilar do Well-Architected; não é uma perspectiva do AWS CAF.",
      "C": "Eficiência de Desempenho é um pilar do Well-Architected, não uma perspectiva do AWS CAF.",
      "D": "Confiabilidade é um pilar do Well-Architected, não uma perspectiva do AWS CAF."
    }
  },
  {
    "id": "clf-c02-security_compliance-129",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "O uso do AWS CloudTrail se alinha melhor com qual princípio de design da AWS?",
    "option_a": "Recuperar-se automaticamente de falhas",
    "option_b": "Realizar operações como código",
    "option_c": "Medir a eficiência",
    "option_d": "Garantir a rastreabilidade",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O CloudTrail registra a atividade da API para sua conta, permitindo a auditoria e a rastreabilidade das ações.",
    "incorrect_explanations": {
      "A": "O CloudTrail não realiza a recuperação; ele registra a atividade para auditoria.",
      "B": "Operações como código refere-se à automação, não ao registro de chamadas de API.",
      "C": "Medir a eficiência é uma preocupação de desempenho; o CloudTrail foca na auditoria."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-130",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece uma rede de entrega de conteúdo (CDN) global para entrega de conteúdo segura e de baixa latência?",
    "option_a": "Amazon EC2",
    "option_b": "Amazon CloudFront",
    "option_c": "Amazon CloudWatch",
    "option_d": "AWS CloudFormation",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon CloudFront é a CDN global da AWS que armazena em cache e entrega conteúdo de forma segura com baixa latência.",
    "incorrect_explanations": {
      "A": "O EC2 fornece capacidade de computação, não funcionalidade de CDN.",
      "C": "O CloudWatch é para monitoramento e observabilidade, não para entrega de conteúdo.",
      "D": "O CloudFormation provisiona infraestrutura como código, não serviços de CDN."
    }
  },
  {
    "id": "clf-c02-billing_pricing-131",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para uma carga de trabalho de produção estável por um ano, qual opção de compra do Amazon EC2 é mais econômica?",
    "option_a": "Hosts Dedicados",
    "option_b": "Instâncias Reservadas",
    "option_c": "Instâncias Sob Demanda",
    "option_d": "Instâncias Spot",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "As Instâncias Reservadas (ou Savings Plans) fornecem descontos significativos para compromissos de uso de estado estável em comparação com Sob Demanda.",
    "incorrect_explanations": {
      "A": "Os Hosts Dedicados são para necessidades de licenciamento e isolamento, não principalmente para economia de custos para estado estável.",
      "C": "Sob Demanda oferece flexibilidade, mas a taxas horárias mais altas.",
      "D": "As Instâncias Spot são as mais baratas, mas podem ser interrompidas e não são ideais para produção estável."
    }
  },
  {
    "id": "clf-c02-billing_pricing-132",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para acessar um relatório sobre o impacto ambiental do uso da AWS, qual recurso do console da AWS uma empresa deve usar?",
    "option_a": "AWS Organizations",
    "option_b": "Política do IAM",
    "option_c": "Console de Faturamento da AWS",
    "option_d": "Amazon SNS",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O console de Faturamento e Gerenciamento de Custos da AWS fornece a Ferramenta de Pegada de Carbono do Cliente que relata o impacto ambiental estimado.",
    "incorrect_explanations": {
      "A": "O Organizations governa contas e políticas; não expõe relatórios de sustentabilidade.",
      "B": "Uma política do IAM é um mecanismo de autorização, não uma ferramenta de relatório.",
      "D": "O SNS é um serviço de mensagens e não fornece painéis de relatório."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-133",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais DUAS são perspectivas que incluem capacidades fundamentais no AWS Cloud Adoption Framework (AWS CAF)? (Selecione DUAS)",
    "option_a": "Sustentabilidade",
    "option_b": "Segurança",
    "option_c": "Operações",
    "option_d": "Eficiência de Desempenho",
    "option_e": "Confiabilidade",
    "correct_answers": [
      "C",
      "D"
    ],
    "explanation_detailed": "O AWS CAF inclui várias perspectivas; Operações e Eficiência de Desempenho são perspectivas que contêm capacidades fundamentais para adotar e operar na AWS.",
    "incorrect_explanations": {
      "A": "Sustentabilidade não é uma perspectiva do AWS CAF.",
      "B": "Segurança é uma perspectiva em alguns contextos, mas o par correto da pergunta foca em Operações e Eficiência de Desempenho como fundamentais neste cenário.",
      "E": "Confiabilidade é um pilar do Well-Architected, não uma perspectiva do AWS CAF."
    }
  },
  {
    "id": "clf-c02-billing_pricing-134",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para otimizar os custos de computação a longo prazo para o AWS Lambda e o Amazon EC2, qual opção de compra deve ser escolhida?",
    "option_a": "Hosts Dedicados",
    "option_b": "Compute Savings Plans",
    "option_c": "Instâncias Reservadas",
    "option_d": "Instâncias Spot",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Os Compute Savings Plans aplicam descontos no EC2, Fargate e Lambda em troca de um compromisso de uso, maximizando a flexibilidade e a economia.",
    "incorrect_explanations": {
      "A": "Os Hosts Dedicados atendem a necessidades de licenciamento/isolamento, não a otimização ampla de custos de computação.",
      "C": "As RIs Padrão são específicas do EC2 e menos flexíveis do que os Savings Plans para o Lambda.",
      "D": "As Instâncias Spot são de baixo custo, mas interrompíveis e não um desconto a longo prazo baseado em compromisso."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-135",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para um armazenamento de dados em memória compatível com a nuvem, qual serviço da AWS deve ser usado?",
    "option_a": "Amazon DynamoDB",
    "option_b": "Amazon ElastiCache",
    "option_c": "Amazon EBS",
    "option_d": "Amazon Redshift",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon ElastiCache fornece Redis e Memcached gerenciados para armazenamento de dados em memória de baixa latência.",
    "incorrect_explanations": {
      "A": "O DynamoDB é armazenamento persistente NoSQL, não um cache em memória.",
      "C": "O EBS é armazenamento de blocos para o EC2, não um serviço de cache.",
      "D": "O Redshift é um data warehouse, não um armazenamento em memória."
    }
  },
  {
    "id": "clf-c02-security_compliance-136",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS oferece acesso sob demanda a relatórios de segurança e conformidade da AWS?",
    "option_a": "AWS Artifact",
    "option_b": "AWS Trusted Advisor",
    "option_c": "Amazon Inspector",
    "option_d": "Console de Faturamento da AWS",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Artifact é o portal central para baixar relatórios e acordos de conformidade.",
    "incorrect_explanations": {
      "B": "O Trusted Advisor fornece orientação de melhores práticas, não documentos de conformidade.",
      "C": "O Inspector realiza avaliações de segurança automatizadas, não relatórios de conformidade.",
      "D": "O Console de Faturamento foca em custo e uso, não diretamente em documentos de conformidade."
    }
  },
  {
    "id": "clf-c02-billing_pricing-137",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual plano de Suporte da AWS inclui serviço de concierge, um Gerente de Contas Técnico (TAM) designado e suporte técnico 24/7?",
    "option_a": "Suporte Básico da AWS",
    "option_b": "Suporte Enterprise da AWS",
    "option_c": "Suporte Empresarial da AWS",
    "option_d": "Suporte para Desenvolvedores da AWS",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Suporte Enterprise da AWS fornece serviço de concierge, um TAM designado e suporte técnico 24/7 com SLAs de resposta rápida.",
    "incorrect_explanations": {
      "A": "O Suporte Básico inclui apenas suporte de conta e faturamento.",
      "C": "O Suporte Empresarial inclui acesso 24/7 a engenheiros, mas não um TAM ou concierge designado.",
      "D": "O Suporte para Desenvolvedores destina-se ao uso não produtivo e não possui concierge/TAM."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-138",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para entregar arquivos estáticos de forma segura globalmente, qual solução da AWS deve ser usada?",
    "option_a": "Amazon Kinesis Data Streams",
    "option_b": "Amazon CloudFront com Amazon S3",
    "option_c": "Amazon EC2 com um Application Load Balancer",
    "option_d": "Amazon EFS",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Combinar o S3 para armazenamento de origem com o CloudFront como CDN fornece entrega global segura e de baixa latência de ativos estáticos.",
    "incorrect_explanations": {
      "A": "O Kinesis Data Streams é para streaming de dados em tempo real, não para entrega de conteúdo.",
      "C": "Um ALB e o EC2 podem servir conteúdo, mas não fornecem cache de borda de CDN.",
      "D": "O EFS é um sistema de arquivos compartilhado para o EC2; não é uma CDN."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-139",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual princípio de design pertence ao pilar de Excelência Operacional do AWS Well-Architected Framework?",
    "option_a": "Criar documentação anotada",
    "option_b": "Antecipar falhas",
    "option_c": "Garantir a eficiência de desempenho",
    "option_d": "Otimizar custos",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "A Excelência Operacional enfatiza a preparação e execução eficaz de cargas de trabalho; manter documentação clara e anotada apoia as operações e a melhoria contínua.",
    "incorrect_explanations": {
      "B": "Antecipar falhas está associado ao pilar de Confiabilidade.",
      "C": "A Eficiência de Desempenho é um pilar separado focado na eficiência de recursos.",
      "D": "A Otimização de Custos é um pilar distinto focado em gastos e eficiência."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-140",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para migrar o Microsoft SQL Server do local para a AWS enquanto reduz a sobrecarga de gerenciamento, qual serviço deve ser usado?",
    "option_a": "Amazon Elastic Container Service (Amazon ECS)",
    "option_b": "Amazon SageMaker",
    "option_c": "Amazon RDS",
    "option_d": "Amazon Athena",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon RDS for SQL Server lida com backups, aplicação de patches e manutenção de rotina, reduzindo a carga operacional.",
    "incorrect_explanations": {
      "A": "O ECS executa contêineres; não é um serviço de banco de dados relacional gerenciado.",
      "B": "O SageMaker é para aprendizado de máquina, não para bancos de dados relacionais.",
      "D": "O Athena consulta dados no S3; não hospeda bancos de dados relacionais."
    }
  },
  {
    "id": "clf-c02-security_compliance-141",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "No modelo de responsabilidade compartilhada da AWS, a que se refere 'segurança da nuvem'?",
    "option_a": "Disponibilidade dos serviços da AWS",
    "option_b": "Segurança da infraestrutura da nuvem",
    "option_c": "Políticas de senha para usuários do IAM",
    "option_d": "Segurança dos ambientes do cliente",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "'Segurança da nuvem' é responsabilidade da AWS de proteger a infraestrutura que executa os serviços da AWS, incluindo instalações, hardware e software.",
    "incorrect_explanations": {
      "A": "A disponibilidade do serviço é um resultado; a pergunta diz respeito a quem protege a infraestrutura.",
      "C": "As políticas de senha para usuários do IAM são responsabilidades do cliente.",
      "D": "Os clientes são responsáveis pela segurança na nuvem para suas cargas de trabalho."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-142",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação de compras online requer um serviço de banco de dados gerenciado para armazenamento de dados. Qual serviço deve ser usado?",
    "option_a": "Amazon RDS",
    "option_b": "Amazon Redshift",
    "option_c": "Amazon ElastiCache",
    "option_d": "Amazon Neptune",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon RDS fornece bancos de dados relacionais gerenciados adequados para back-ends de aplicativos transacionais.",
    "incorrect_explanations": {
      "B": "O Redshift é um data warehouse para análise, não OLTP.",
      "C": "O ElastiCache é um cache em memória, não um sistema de registro primário.",
      "D": "O Neptune é um banco de dados de grafos para cargas de trabalho de grafos, não para armazenamento transacional geral."
    }
  },
  {
    "id": "clf-c02-billing_pricing-143",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço ou ferramenta da AWS ajuda as empresas a medir o impacto ambiental de seu uso da AWS?",
    "option_a": "Ferramenta de Pegada de Carbono do Cliente da AWS",
    "option_b": "AWS Compute Optimizer",
    "option_c": "Pilar de Sustentabilidade",
    "option_d": "OS-Climate",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "A Ferramenta de Pegada de Carbono do Cliente no console de Faturamento fornece insights sobre as emissões de carbono estimadas associadas ao uso da AWS.",
    "incorrect_explanations": {
      "B": "O Compute Optimizer recomenda o dimensionamento de recursos; não mede o impacto de carbono.",
      "C": "O pilar de Sustentabilidade é uma orientação, não uma ferramenta de relatório.",
      "D": "O OS-Climate é uma iniciativa aberta, não um recurso de relatório de uso da AWS."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-144",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Para implantar aplicações de monitoramento o mais próximo possível das máquinas de fábrica com a menor latência, qual solução da AWS deve ser usada?",
    "option_a": "AWS Outposts",
    "option_b": "Amazon EC2",
    "option_c": "AWS App Runner",
    "option_d": "AWS Batch",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Outposts estende os serviços nativos da AWS no local, colocando computação e armazenamento fisicamente perto dos equipamentos para minimizar a latência.",
    "incorrect_explanations": {
      "B": "O EC2 em uma Região da AWS pode introduzir maior latência de rede em comparação com os Outposts no local.",
      "C": "O App Runner é um serviço de aplicação web totalmente gerenciado em Regiões, não no local.",
      "D": "O AWS Batch executa computação em lote na nuvem; não é uma opção de implantação no local."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-145",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Para melhorar o impacto da sustentabilidade, quais DUAS melhores práticas uma empresa deve implementar? (Selecione DUAS)",
    "option_a": "Escalar a infraestrutura com a carga do usuário",
    "option_b": "Maximizar a distância entre as cargas de trabalho e os usuários",
    "option_c": "Eliminar ativos não utilizados",
    "option_d": "Escalar recursos com capacidade excedente",
    "option_e": "Escalar a infraestrutura com base apenas na contagem de usuários",
    "correct_answers": [
      "A",
      "C"
    ],
    "explanation_detailed": "Corresponder a capacidade à carga real e remover recursos ociosos reduz o desperdício e o consumo de energia, melhorando a sustentabilidade.",
    "incorrect_explanations": {
      "B": "Aumentar a distância física pode aumentar a sobrecarga de rede e o uso de energia.",
      "D": "O superprovisionamento desperdiça recursos e energia.",
      "E": "A contagem de usuários por si só não é um sinal confiável; a carga real deve impulsionar o escalonamento."
    }
  },
  {
    "id": "clf-c02-security_compliance-146",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "No modelo de responsabilidade compartilhada da AWS, quais DUAS tarefas são responsabilidades da AWS? (Selecione DUAS)",
    "option_a": "Configurar o IAM",
    "option_b": "Configurar os grupos de segurança do EC2",
    "option_c": "Proteger o acesso físico às instalações da AWS",
    "option_d": "Aplicar patches em aplicações executadas em instâncias do EC2",
    "option_e": "Manter a infraestrutura subjacente",
    "correct_answers": [
      "C",
      "E"
    ],
    "explanation_detailed": "A AWS é responsável por proteger suas instalações e manter a infraestrutura global que executa os serviços da AWS.",
    "incorrect_explanations": {
      "A": "Os clientes configuram políticas e funções do IAM para suas contas.",
      "B": "Os clientes configuram grupos de segurança para suas instâncias.",
      "D": "A aplicação de patches em aplicações no EC2 é responsabilidade do cliente."
    }
  },
  {
    "id": "clf-c02-billing_pricing-147",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Em quais DUAS categorias o AWS Trusted Advisor fornece ações recomendadas? (Selecione DUAS)",
    "option_a": "Aplicação de patches no sistema operacional",
    "option_b": "Otimização de custos",
    "option_c": "Automação de tarefas repetitivas",
    "option_d": "Cotas de serviço",
    "option_e": "Logs de atividade da conta",
    "correct_answers": [
      "B",
      "D"
    ],
    "explanation_detailed": "O Trusted Advisor oferece verificações e recomendações em áreas que incluem otimização de custos e cotas de serviço, entre outras.",
    "incorrect_explanations": {
      "A": "A aplicação de patches no SO não é uma categoria do Trusted Advisor.",
      "C": "A automação de tarefas repetitivas não é uma categoria do Trusted Advisor.",
      "D": "Os logs de atividade da conta são fornecidos por serviços como o CloudTrail, não pelo Trusted Advisor."
    }
  },
  {
    "id": "clf-c02-security_compliance-148",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS é sempre gratuito para usar?",
    "option_a": "Amazon S3",
    "option_b": "Amazon Aurora",
    "option_c": "Amazon EC2",
    "option_d": "AWS Identity and Access Management (IAM)",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O IAM é fornecido sem custo adicional para criar usuários, grupos, funções e políticas para controlar o acesso aos recursos da AWS.",
    "incorrect_explanations": {
      "A": "O S3 cobra por armazenamento, solicitações e transferência de dados.",
      "B": "O Aurora é um serviço de banco de dados gerenciado pago.",
      "C": "O EC2 cobra pela capacidade de computação e recursos relacionados."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-149",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa melhorar o desempenho global de seu site de e-commerce. O que ela deve fazer?",
    "option_a": "Mudar a classe de armazenamento do S3 para S3 Intelligent-Tiering",
    "option_b": "Implementar uma distribuição do Amazon CloudFront para armazenar em cache o conteúdo do servidor web",
    "option_c": "Usar o Amazon API Gateway para o serviço web",
    "option_d": "Migrar os servidores de e-commerce para o Amazon EC2 com rede aprimorada",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O CloudFront armazena conteúdo em cache em locais de borda em todo o mundo, reduzindo a latência e melhorando o desempenho global para os usuários da web.",
    "incorrect_explanations": {
      "A": "O S3 Intelligent-Tiering otimiza o custo de armazenamento, não o desempenho da entrega na web.",
      "C": "O API Gateway é para gerenciamento de APIs e não atua como uma CDN para ativos da web.",
      "D": "A rede aprimorada pode ajudar no desempenho dentro da Região, mas não fornece cache de borda global."
    }
  },
  {
    "id": "clf-c02-security_compliance-150",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais DOIS serviços da AWS são projetados para proteger uma carga de trabalho contra injeção de SQL, cross-site scripting e ataques DDoS? (Selecione DOIS)",
    "option_a": "Endpoint da VPC",
    "option_b": "AWS Shield Standard",
    "option_c": "AWS Config",
    "option_d": "AWS WAF",
    "correct_answers": [
      "B",
      "D"
    ],
    "explanation_detailed": "O AWS Shield Standard fornece proteção gerenciada contra DDoS, e o AWS WAF filtra solicitações HTTP maliciosas, como SQLi e XSS.",
    "incorrect_explanations": {
      "A": "Os endpoints da VPC conectam VPCs a serviços de forma privada; não são filtros de segurança para ameaças da web.",
      "C": "O AWS Config rastreia alterações na configuração de recursos; não é um controle de proteção contra ataques da web."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-151",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa está construindo uma aplicação que receberá milhões de consultas de banco de dados por segundo. Qual serviço da AWS atenderá a essa necessidade?",
    "option_a": "Amazon DynamoDB",
    "option_b": "AWS Cloud9",
    "option_c": "Amazon ElastiCache for Memcached",
    "option_d": "Amazon Neptune",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon DynamoDB é um banco de dados NoSQL totalmente gerenciado que oferece desempenho de milissegundos de um dígito em praticamente qualquer escala e pode lidar com milhões de solicitações por segundo.",
    "incorrect_explanations": {
      "B": "O AWS Cloud9 é um IDE na nuvem, não um serviço de banco de dados.",
      "C": "O ElastiCache é um cache em memória; não é um banco de dados primário de registro para cargas de trabalho massivas de escrita/leitura.",
      "D": "O Amazon Neptune é um banco de dados de grafos otimizado para consultas de grafos, não para acesso de chave-valor de alto rendimento."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-152",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa usa o Amazon RDS e quer aumentar a resiliência de uma aplicação crítica para os negócios. Como a empresa pode aumentar a resiliência?",
    "option_a": "Implantar uma cópia da aplicação em outra conta da AWS.",
    "option_b": "Usar várias VPCs para a aplicação.",
    "option_c": "Usar várias sub-redes para a aplicação.",
    "option_d": "Usar várias Zonas de Disponibilidade.",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "Habilitar o Multi-AZ para o Amazon RDS fornece replicação síncrona para uma instância de espera em outra Zona de Disponibilidade, melhorando a disponibilidade e a resiliência.",
    "incorrect_explanations": {
      "A": "Outra conta não melhora inerentemente a disponibilidade do banco de dados.",
      "B": "Várias VPCs não fornecem diretamente resiliência de failover de banco de dados.",
      "C": "Várias sub-redes por si só não garantem alta disponibilidade para a camada de banco de dados."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-153",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um desenvolvedor deve manter ambientes de desenvolvimento e produção reproduzíveis. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS Ground Station",
    "option_b": "AWS Shield",
    "option_c": "AWS IoT Device Defender",
    "option_d": "AWS CloudFormation",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS CloudFormation modela e provisiona recursos de maneira repetível e controlada por versão usando infraestrutura como código.",
    "incorrect_explanations": {
      "A": "O Ground Station é para comunicações via satélite, não IaC.",
      "B": "O AWS Shield fornece proteção contra DDoS; não provisiona ambientes.",
      "C": "O IoT Device Defender audita configurações de IoT; não cria pilhas de infraestrutura."
    }
  },
  {
    "id": "clf-c02-billing_pricing-154",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais ações são exemplos de dimensionamento correto ou controle de custos na AWS? (Selecione DOIS)",
    "option_a": "Mudar do Amazon RDS para o Amazon DynamoDB.",
    "option_b": "Selecionar tipos de instância do Amazon EC2 com base em padrões de utilização anteriores.",
    "option_c": "Usar políticas de ciclo de vida do Amazon S3 para transferir objetos acessados com pouca frequência para camadas de menor custo.",
    "option_d": "Usar implantações Multi-AZ para o Amazon RDS.",
    "option_e": "Substituir as instâncias existentes do Amazon EC2 pelo AWS Elastic Beanstalk.",
    "correct_answers": [
      "B",
      "C"
    ],
    "explanation_detailed": "Escolher tipos de EC2 com base na utilização histórica real e usar transições de ciclo de vida do S3 são técnicas comprovadas de otimização de custos.",
    "incorrect_explanations": {
      "A": "A troca de motores de banco de dados pode não reduzir o custo e pode introduzir complexidade na migração.",
      "D": "O Multi-AZ melhora a disponibilidade; geralmente aumenta o custo.",
      "E": "O Elastic Beanstalk simplifica as operações, mas não é inerentemente uma ação de redução de custos."
    }
  },
  {
    "id": "clf-c02-security_compliance-155",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa suspeita que seus recursos da AWS estão sendo usados para atividades ilegais. Qual grupo da AWS deve ser notificado?",
    "option_a": "Equipe de Abuso da AWS",
    "option_b": "Equipe de Suporte da AWS",
    "option_c": "Gerentes de Contas Técnicos (TAMs) da AWS",
    "option_d": "Equipe de Serviços Profissionais da AWS",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "A equipe de Abuso da AWS lida com denúncias de suspeita de uso abusivo ou ilegal de recursos da AWS.",
    "incorrect_explanations": {
      "B": "O Suporte auxilia com questões técnicas/de conta; denúncias de abuso são tratadas pela equipe de Abuso.",
      "C": "Os TAMs fornecem orientação para clientes do Suporte Enterprise; eles não são o canal de denúncia de abuso.",
      "D": "Os Serviços Profissionais fornecem consultoria; não lidam com denúncias de abuso."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-156",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa tem um bucket do Amazon S3 com imagens de faturas financeiras digitalizadas e precisa de um aplicativo baseado em IA para identificar e ler os saldos totais. Qual serviço da AWS atende a esse requisito?",
    "option_a": "Amazon Forecast",
    "option_b": "Amazon Textract",
    "option_c": "Amazon Rekognition",
    "option_d": "Amazon Lex",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon Textract extrai texto e dados estruturados, como pares de chave-valor e tabelas, de documentos digitalizados.",
    "incorrect_explanations": {
      "A": "O Forecast é para previsão de séries temporais, não OCR de documentos.",
      "C": "O Rekognition é especializado em análise de imagem/vídeo, não em extração de texto de documentos.",
      "D": "O Lex constrói interfaces de conversação; não lê faturas."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-157",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual benefício da nuvem AWS permite custos de uso mais baixos devido à demanda agregada entre os clientes?",
    "option_a": "Não há necessidade de adivinhar a capacidade",
    "option_b": "Alcance global em minutos",
    "option_c": "Economias de escala",
    "option_d": "Maior velocidade e agilidade",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "A AWS agrega a demanda e repassa as eficiências de volume aos clientes, diminuindo os custos por unidade.",
    "incorrect_explanations": {
      "A": "O provisionamento sob demanda reduz o risco de capacidade, mas não é o efeito da economia de escala.",
      "B": "O alcance global diz respeito à presença geográfica, não à agregação de custos.",
      "D": "A agilidade acelera a entrega, mas não diminui diretamente os custos unitários."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-158",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação web era executada em uma única instância do Amazon EC2, armazenando documentos enviados por usuários em um volume EBS anexado. A empresa duplicou a pilha em outra AZ e colocou ambas as instâncias atrás de um Application Load Balancer. Os usuários agora veem apenas um subconjunto de documentos, dependendo do servidor que acessam. O que um arquiteto de soluções deve propor para que os usuários possam ver todos os documentos de uma vez?",
    "option_a": "Copiar os dados para que ambos os volumes EBS contenham todos os documentos.",
    "option_b": "Configurar o ALB para sempre enviar um usuário ao servidor que possui os documentos do usuário.",
    "option_c": "Copiar os dados de ambos os volumes EBS para o Amazon EFS e modificar a aplicação para armazenar novos documentos no EFS.",
    "option_d": "Configurar o ALB para enviar cada solicitação a ambos os servidores e agregar os resultados.",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon EFS fornece um sistema de arquivos compartilhado e multi-AZ acessível por várias instâncias do EC2, garantindo um único repositório de documentos autoritativo.",
    "incorrect_explanations": {
      "A": "Manter duas cópias independentes requer sincronização constante e corre o risco de divergência.",
      "B": "O roteamento fixo (sticky routing) não resolve a consistência dos dados ou o acesso de múltiplos gravadores.",
      "D": "Solicitações duplas adicionam complexidade e latência e não fornecem armazenamento compartilhado."
    }
  },
  {
    "id": "clf-c02-billing_pricing-159",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa executa cargas de trabalho para vários departamentos em uma única VPC e precisa faturar cada departamento pelo uso de seus recursos com sobrecarga operacional mínima. O que a empresa deve fazer?",
    "option_a": "Adicionar uma tag de departamento a cada recurso e configurar tags de alocação de custos.",
    "option_b": "Mover os recursos de cada departamento para sua própria VPC.",
    "option_c": "Mover os recursos de cada departamento para sua própria conta da AWS.",
    "option_d": "Usar o AWS Organizations para obter um relatório de faturamento por departamento.",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "As tags de alocação de custos permitem atribuir custos por departamento com re-arquitetura mínima.",
    "incorrect_explanations": {
      "B": "Várias VPCs aumentam a complexidade e não atribuem custos inerentemente.",
      "C": "Várias contas podem ajudar no estorno, mas adicionam sobrecarga significativa.",
      "D": "O Organizations fornece faturamento consolidado por conta, não por tags de departamento dentro de uma conta."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-160",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Uma empresa precisa de um repositório de código-fonte e uma maneira de atualizar o software em execução quando o código muda. Quais DOIS serviços da AWS atendem a esses requisitos? (Selecione DOIS)",
    "option_a": "AWS CodeCommit",
    "option_b": "AWS CodeDeploy",
    "option_c": "Amazon DynamoDB",
    "option_d": "Amazon S3",
    "option_e": "Amazon Elastic Container Service (Amazon ECS)",
    "correct_answers": [
      "A",
      "B"
    ],
    "explanation_detailed": "O CodeCommit hospeda repositórios Git seguros, e o CodeDeploy automatiza as implantações no EC2, servidores locais ou alvos sem servidor.",
    "incorrect_explanations": {
      "C": "O DynamoDB é um banco de dados NoSQL, não um repositório de código ou ferramenta de implantação.",
      "D": "O S3 pode armazenar artefatos, mas não é um repositório de código ou serviço de implantação.",
      "E": "O ECS executa contêineres; não fornece hospedagem Git ou orquestração de implantação por si só."
    }
  },
  {
    "id": "clf-c02-billing_pricing-161",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma carga de trabalho de computação sem estado, tolerante a falhas e massivamente paralela pode tolerar interrupções. Qual modelo de precificação do Amazon EC2 deve ser escolhido para reduzir os custos?",
    "option_a": "Instâncias Sob Demanda",
    "option_b": "Instâncias Spot",
    "option_c": "Instâncias Reservadas",
    "option_d": "Instâncias Dedicadas",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "As Instâncias Spot usam a capacidade ociosa do EC2 com grandes descontos e são ideais para cargas de trabalho paralelas e tolerantes a interrupções.",
    "incorrect_explanations": {
      "A": "Sob Demanda oferece flexibilidade, mas a um custo mais alto.",
      "C": "As Instâncias Reservadas são adequadas para cargas de trabalho de estado estável, não para trabalhos em lote tolerantes a interrupções.",
      "D": "As Instâncias Dedicadas abordam o isolamento, não a redução de custos para este caso de uso."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-162",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação crítica é executada em um local remoto com conectividade lenta à internet e é sensível à latência. A empresa quer migrar para a AWS. Qual oferta da AWS atende a esses requisitos?",
    "option_a": "Zonas de Disponibilidade",
    "option_b": "AWS Local Zones",
    "option_c": "AWS Wavelength",
    "option_d": "AWS Outposts",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS Outposts traz infraestrutura AWS totalmente gerenciada para o local, minimizando a latência e a dependência de links WAN não confiáveis.",
    "incorrect_explanations": {
      "A": "As Zonas de Disponibilidade estão nas Regiões da AWS, não no local.",
      "B": "As Local Zones estendem a AWS para mais perto dos usuários finais em áreas metropolitanas, não para os locais dos clientes.",
      "C": "O Wavelength é para latência ultrabaixa nas bordas das telecomunicações, não nos data centers dos clientes."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-163",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS é projetado para orquestrar um fluxo de trabalho em um conjunto de funções do AWS Lambda?",
    "option_a": "Amazon DynamoDB",
    "option_b": "AWS CodePipeline",
    "option_c": "AWS Batch",
    "option_d": "AWS Step Functions",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS Step Functions coordena fluxos de trabalho sem servidor com máquinas de estado visuais, encadeando e ramificando execuções do Lambda.",
    "incorrect_explanations": {
      "A": "O DynamoDB é um banco de dados e não orquestra fluxos de trabalho.",
      "B": "O CodePipeline orquestra CI/CD, não a lógica geral do fluxo de trabalho do Lambda.",
      "C": "O AWS Batch agenda trabalhos em lote, não fluxos de trabalho do Lambda orientados a eventos."
    }
  },
  {
    "id": "clf-c02-security_compliance-165",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um provedor de SaaS tem um novo cliente em um país diferente e precisa hospedar os dados desse cliente nesse país. Qual construção da AWS deve ser usada?",
    "option_a": "AWS Shield",
    "option_b": "Amazon S3 Object Lock",
    "option_c": "Regiões da AWS",
    "option_d": "Grupos de posicionamento",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Selecionar a Região da AWS apropriada permite que os dados sejam armazenados e processados dentro de limites geográficos específicos para atender aos requisitos de residência.",
    "incorrect_explanations": {
      "A": "O AWS Shield protege contra DDoS; não determina a localização dos dados.",
      "B": "O Object Lock impõe a retenção; não impõe a residência geográfica.",
      "D": "Os grupos de posicionamento controlam o posicionamento do EC2, não a residência dos dados."
    }
  },
  {
    "id": "clf-c02-billing_pricing-166",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um servidor web precisa ser executado no Amazon EC2 por pelo menos um ano sem interrupções. Qual opção de compra do EC2 é mais econômica?",
    "option_a": "Instâncias Sob Demanda",
    "option_b": "Instâncias Reservadas com Pagamento Parcial Antecipado",
    "option_c": "Instâncias Spot",
    "option_d": "Instâncias Reservadas sem Pagamento Antecipado",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "As Instâncias Reservadas com um compromisso e pagamento parcial antecipado fornecem descontos significativos para cargas de trabalho estáveis e sempre ativas.",
    "incorrect_explanations": {
      "A": "Sob Demanda oferece flexibilidade, mas a um custo mais alto para uso estável de um ano.",
      "C": "As Instâncias Spot são interrompíveis e não são adequadas para cargas de trabalho não disruptivas.",
      "D": "As RIs sem pagamento antecipado oferecem economia, mas geralmente menos do que as com pagamento parcial/total antecipado."
    }
  },
  {
    "id": "clf-c02-security_compliance-167",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual grupo compartilha a responsabilidade com a AWS pela segurança e conformidade das contas e recursos da AWS?",
    "option_a": "Fornecedores terceirizados",
    "option_b": "Clientes",
    "option_c": "Parceiros revendedores",
    "option_d": "Provedores de serviço de internet",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Sob o modelo de responsabilidade compartilhada, os clientes são responsáveis pela segurança na nuvem, como IAM, proteção de dados e configuração.",
    "incorrect_explanations": {
      "A": "Os fornecedores podem fornecer ferramentas, mas a responsabilidade permanece com os clientes e a AWS.",
      "C": "Os revendedores não assumem a responsabilidade pela segurança da conta de um cliente.",
      "D": "Os ISPs não fazem parte do modelo de responsabilidade compartilhada da AWS."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-168",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Uma empresa criou uma sub-rede em sua VPC e quer torná-la pública. Quais DOIS recursos da AWS são necessários? (Selecione DOIS)",
    "option_a": "Gateway da internet da Amazon VPC",
    "option_b": "Gateway NAT da Amazon VPC",
    "option_c": "Tabelas de rotas da Amazon VPC",
    "option_d": "ACLs de rede da Amazon VPC",
    "option_e": "Grupos de segurança do Amazon EC2",
    "correct_answers": [
      "A",
      "C"
    ],
    "explanation_detailed": "Uma sub-rede pública requer um gateway da internet anexado à VPC e uma tabela de rotas que roteia 0.0.0.0/0 para esse gateway da internet.",
    "incorrect_explanations": {
      "B": "Um gateway NAT fornece saída para a internet para sub-redes privadas, não entrada pública.",
      "D": "As ACLs de rede filtram o tráfego, mas não tornam uma sub-rede pública por si mesmas.",
      "E": "Os grupos de segurança protegem as instâncias; não definem o roteamento da internet da sub-rede."
    }
  },
  {
    "id": "clf-c02-billing_pricing-169",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual ferramenta da AWS uma empresa deve usar para prever os gastos com a AWS?",
    "option_a": "Amazon DevPay",
    "option_b": "AWS Organizations",
    "option_c": "AWS Trusted Advisor",
    "option_d": "Cost Explorer",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS Cost Explorer fornece análise e previsão de custos para planejar orçamentos futuros e acompanhar tendências.",
    "incorrect_explanations": {
      "A": "O DevPay é um serviço de faturamento legado não usado para previsão.",
      "B": "O Organizations centraliza a governança e o faturamento entre contas, mas não prevê os gastos.",
      "C": "O Trusted Advisor oferece verificações de melhores práticas; não realiza previsão de gastos."
    }
  },
  {
    "id": "clf-c02-security_compliance-170",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "De acordo com o modelo de responsabilidade compartilhada da AWS, qual é uma responsabilidade do cliente?",
    "option_a": "Gerenciamento de identidade e acesso",
    "option_b": "Inicialização do disco rígido",
    "option_c": "Proteção do hardware do data center",
    "option_d": "Proteção das Zonas de Disponibilidade",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Os clientes gerenciam políticas, usuários e funções do IAM que governam o acesso a seus recursos.",
    "incorrect_explanations": {
      "B": "A AWS gerencia a mídia física e a inicialização do hardware.",
      "C": "A AWS protege e mantém o hardware do data center.",
      "D": "A AWS protege as Zonas de Disponibilidade como parte da infraestrutura da nuvem."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-171",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais capacidades estão na perspectiva de Plataforma do AWS Cloud Adoption Framework (AWS CAF)? (Selecione DOIS)",
    "option_a": "Gerenciamento de desempenho e capacidade",
    "option_b": "Engenharia de dados",
    "option_c": "Integração contínua e entrega contínua (CI/CD)",
    "option_d": "Proteção da infraestrutura",
    "option_e": "Gerenciamento de mudanças e lançamentos",
    "correct_answers": [
      "B",
      "C"
    ],
    "explanation_detailed": "A perspectiva de Plataforma inclui capacidades como engenharia de dados e CI/CD para construir e operar uma plataforma de nuvem escalável.",
    "incorrect_explanations": {
      "A": "O gerenciamento de desempenho e capacidade se alinha mais com as perspectivas de Operações/Negócios.",
      "D": "A proteção da infraestrutura se alinha com a perspectiva de Segurança.",
      "E": "O gerenciamento de mudanças e lançamentos se alinha com os processos de Operações/Negócios."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-172",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer armazenar logs de servidor de forma econômica e executar consultas ocasionais para obter insights. Qual serviço da AWS deve ser usado para armazenar os dados de forma mais econômica?",
    "option_a": "Amazon Aurora",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Amazon S3",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon S3 fornece armazenamento de objetos durável, altamente escalável e de baixo custo, ideal para grandes arquivos de log.",
    "incorrect_explanations": {
      "A": "O Aurora é um banco de dados relacional, não adequado para armazenamento de objetos de log bruto com o menor custo.",
      "B": "O EFS é um sistema de arquivos POSIX e geralmente mais caro do que o S3 para arquivos de log.",
      "C": "O EBS é armazenamento de blocos para o EC2 e não é econômico para logs grandes e acessados com pouca frequência."
    }
  },
  {
    "id": "clf-c02-security_compliance-173",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de uma lista de usuários do IAM e do status de suas credenciais (senhas, chaves de acesso, dispositivos MFA). Qual recurso da AWS atende a esse requisito?",
    "option_a": "Relatório de credenciais do IAM",
    "option_b": "AWS IAM Identity Center (AWS Single Sign-On)",
    "option_c": "AWS Identity and Access Management Access Analyzer",
    "option_d": "Relatório de Custos e Uso da AWS",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O relatório de credenciais do IAM fornece um instantâneo para download dos usuários do IAM e do status de suas credenciais.",
    "incorrect_explanations": {
      "B": "O IAM Identity Center gerencia o SSO, mas não gera relatórios de status de credenciais do IAM.",
      "C": "O Access Analyzer avalia as permissões para acesso não intencional, não o status das credenciais.",
      "D": "O Relatório de Custos e Uso é para dados de faturamento, não para credenciais do IAM."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-174",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece um único lugar para acompanhar o progresso das migrações de aplicativos?",
    "option_a": "AWS Application Discovery Service",
    "option_b": "AWS Application Migration Service",
    "option_c": "AWS Service Catalog",
    "option_d": "AWS Migration Hub",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS Migration Hub centraliza a visibilidade do status da migração em várias ferramentas e aplicativos.",
    "incorrect_explanations": {
      "A": "O Application Discovery Service descobre ativos locais, mas não é o hub central de rastreamento.",
      "B": "O Application Migration Service realiza migrações lift-and-shift; o Migration Hub acompanha o progresso.",
      "C": "O Service Catalog governa os portfólios de produtos, não o rastreamento de migrações."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-175",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa executa um banco de dados MySQL no local e quer executar uma cópia na AWS. Qual serviço suporta essa carga de trabalho?",
    "option_a": "Amazon RDS",
    "option_b": "Amazon Neptune",
    "option_c": "Amazon ElastiCache for Redis",
    "option_d": "Amazon Quantum Ledger Database (Amazon QLDB)",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon RDS suporta MySQL com backups, aplicação de patches e escalonamento gerenciados.",
    "incorrect_explanations": {
      "B": "O Neptune é um banco de dados de grafos, não MySQL relacional.",
      "C": "O ElastiCache é um cache em memória, não um banco de dados relacional.",
      "D": "O QLDB é um banco de dados de ledger, não um motor compatível com MySQL."
    }
  },
  {
    "id": "clf-c02-security_compliance-176",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa implementar o gerenciamento de identidade para uma frota de aplicativos móveis executados na AWS. Qual serviço deve ser usado?",
    "option_a": "Amazon Cognito",
    "option_b": "AWS Security Hub",
    "option_c": "AWS Shield",
    "option_d": "AWS WAF",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon Cognito fornece inscrição de usuário, login e federação de identidade para aplicativos web e móveis.",
    "incorrect_explanations": {
      "B": "O Security Hub agrega descobertas de segurança; não é um provedor de identidade.",
      "C": "O Shield fornece proteção contra DDoS, não gerenciamento de identidade.",
      "D": "O AWS WAF filtra solicitações da web; não gerencia identidades."
    }
  },
  {
    "id": "clf-c02-security_compliance-177",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de um serviço automatizado de gerenciamento de vulnerabilidades que verifique continuamente as cargas de trabalho da AWS em busca de vulnerabilidades de software. Qual serviço deve ser usado?",
    "option_a": "Amazon GuardDuty",
    "option_b": "Amazon Inspector",
    "option_c": "AWS Security Hub",
    "option_d": "AWS Shield",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon Inspector verifica continuamente o EC2, as imagens de contêiner do ECR e as funções do Lambda em busca de vulnerabilidades de software e exposição de rede não intencional.",
    "incorrect_explanations": {
      "A": "O GuardDuty detecta ameaças usando telemetria; não é um scanner de vulnerabilidades.",
      "C": "O Security Hub consolida as descobertas; não é um scanner em si.",
      "D": "O Shield fornece proteção contra DDoS, não avaliação de vulnerabilidades."
    }
  },
  {
    "id": "clf-c02-security_compliance-178",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "De acordo com o modelo de responsabilidade compartilhada da AWS, quais DUAS tarefas são responsabilidades do cliente? (Selecione DOIS)",
    "option_a": "Configurar o firewall do grupo de segurança fornecido pela AWS.",
    "option_b": "Classificar os ativos da empresa hospedados na AWS.",
    "option_c": "Escolher quais Zonas de Disponibilidade usar para os buckets do Amazon S3.",
    "option_d": "Aplicar patches ou atualizar o Amazon DynamoDB.",
    "option_e": "Selecionar instâncias do Amazon EC2 para executar o AWS Lambda.",
    "correct_answers": [
      "A",
      "B"
    ],
    "explanation_detailed": "Os clientes são responsáveis pela segurança na nuvem, incluindo a configuração de grupos de segurança e a classificação de seus dados e ativos.",
    "incorrect_explanations": {
      "C": "O S3 é um serviço Regional; os clientes não escolhem AZs para buckets.",
      "D": "A AWS gerencia a aplicação de patches para o DynamoDB como um serviço gerenciado.",
      "E": "O Lambda é sem servidor; os clientes não selecionam instâncias do EC2 para ele."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-179",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer monitorar o desempenho da carga de trabalho e garantir que os serviços em nuvem sejam entregues em níveis que atendam às necessidades do negócio. Qual perspectiva do AWS Cloud Adoption Framework (AWS CAF) aborda isso?",
    "option_a": "Negócios",
    "option_b": "Governança",
    "option_c": "Plataforma",
    "option_d": "Operações",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "A perspectiva de Operações foca em operar e monitorar cargas de trabalho para atender aos resultados de negócios definidos.",
    "incorrect_explanations": {
      "A": "A perspectiva de Negócios foca em valor e resultados, não em monitoramento operacional.",
      "B": "A Governança foca em políticas e controles, não em operações de desempenho do dia-a-dia.",
      "C": "A Plataforma foca em capacidades técnicas, não em operações de nível de serviço."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-180",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa de um serviço de ML totalmente gerenciado para recomendar produtos com base no comportamento anterior dos clientes. Qual serviço da AWS atende a essa necessidade?",
    "option_a": "Amazon Personalize",
    "option_b": "Amazon SageMaker",
    "option_c": "Amazon Pinpoint",
    "option_d": "Amazon Comprehend",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon Personalize constrói modelos de recomendação personalizados em tempo real a partir de dados de interação do cliente com o mínimo de conhecimento de ML necessário.",
    "incorrect_explanations": {
      "B": "O SageMaker é uma plataforma geral de ML; o Personalize é construído especificamente para recomendações.",
      "C": "O Pinpoint é para engajamento e mensagens do usuário, não para recomendações.",
      "D": "O Comprehend realiza tarefas de PNL, não recomendações de produtos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-181",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual é o propósito de ter um gateway da internet em uma VPC?",
    "option_a": "Criar uma conexão VPN com a VPC",
    "option_b": "Habilitar a comunicação entre a VPC e a internet",
    "option_c": "Impor limites de largura de banda no tráfego da internet",
    "option_d": "Balancear a carga do tráfego da internet entre as instâncias do EC2",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Um gateway da internet fornece um alvo nas tabelas de rotas para o tráfego roteável pela internet e realiza NAT para instâncias com IPs públicos.",
    "incorrect_explanations": {
      "A": "As VPNs são estabelecidas com gateways privados virtuais ou o AWS Client VPN, não com o gateway da internet.",
      "C": "Um gateway da internet não impõe restrições de largura de banda.",
      "D": "O balanceamento de carga é feito pelo ELB, não pelo gateway da internet."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-182",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa está construindo um aplicativo móvel para fornecer recomendações de compras e quer usar um banco de dados de grafos como parte do motor. Qual serviço de banco de dados da AWS deve ser escolhido?",
    "option_a": "Amazon DynamoDB",
    "option_b": "Amazon Aurora",
    "option_c": "Amazon Neptune",
    "option_d": "Amazon DocumentDB (com compatibilidade com MongoDB)",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon Neptune é um banco de dados de grafos totalmente gerenciado que suporta grafos de propriedades e RDF para conjuntos de dados altamente conectados, como recomendações.",
    "incorrect_explanations": {
      "A": "O DynamoDB é um armazenamento de chave-valor/documento, não um motor de grafos.",
      "B": "O Aurora é um banco de dados relacional, não de grafos.",
      "D": "O DocumentDB é um banco de dados de documentos, não um banco de dados de grafos."
    }
  },
  {
    "id": "clf-c02-security_compliance-183",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Os funcionários mudam de equipe com frequência, e as permissões devem corresponder às responsabilidades do trabalho com sobrecarga operacional mínima. Qual recurso do IAM deve ser usado?",
    "option_a": "Grupos de usuários do IAM",
    "option_b": "Funções do IAM",
    "option_c": "Perfis de instância do IAM",
    "option_d": "Políticas individuais de usuário do IAM",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "As funções do IAM fornecem credenciais temporárias e permitem que as permissões sejam assumidas com base na função, reduzindo o gerenciamento de políticas específicas do usuário.",
    "incorrect_explanations": {
      "A": "Os grupos ajudam a gerenciar usuários, mas não fornecem assunção temporária ou flexibilidade entre contas.",
      "C": "Os perfis de instância anexam funções ao EC2, não aos usuários finais.",
      "D": "As políticas individuais aumentam a sobrecarga de gerenciamento e o risco de inconsistência."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-184",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer uma aplicação web confiável hospedada no Amazon EC2. Qual abordagem atinge esse objetivo?",
    "option_a": "Lançar instâncias grandes do EC2 na mesma Zona de Disponibilidade.",
    "option_b": "Distribuir as instâncias do EC2 em mais de um grupo de segurança.",
    "option_c": "Distribuir as instâncias do EC2 em mais de uma Zona de Disponibilidade.",
    "option_d": "Usar uma Imagem de Máquina da Amazon (AMI) do AWS Marketplace.",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Distribuir instâncias em várias Zonas de Disponibilidade melhora a tolerância a falhas e a disponibilidade, isolando as falhas.",
    "incorrect_explanations": {
      "A": "Implantações em uma única Zona de Disponibilidade são um único ponto de falha.",
      "B": "Os grupos de segurança controlam o tráfego; usar vários grupos não aumenta a disponibilidade.",
      "D": "A origem de uma AMI não determina a arquitetura de resiliência."
    }
  },
  {
    "id": "clf-c02-security_compliance-185",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Sob o modelo de responsabilidade compartilhada da AWS para o AWS Lambda, qual é a responsabilidade do cliente?",
    "option_a": "Gerenciar o código dentro da função Lambda",
    "option_b": "Verificar a operação do hardware no data center",
    "option_c": "Aplicar patches no sistema operacional",
    "option_d": "Desligar as funções Lambda quando não estiverem mais em uso",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "Os clientes são responsáveis por seu código e configurações do IAM; a AWS gerencia a infraestrutura subjacente e o SO para o Lambda.",
    "incorrect_explanations": {
      "B": "A AWS gerencia as operações de hardware do data center.",
      "C": "A AWS gerencia a aplicação de patches no SO para o Lambda sem servidor.",
      "D": "A AWS escala o Lambda sob demanda; o desligamento explícito não é necessário."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-186",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma equipe de desenvolvimento quer implantar vários ambientes de teste de forma rápida e repetível. Qual serviço da AWS a equipe deve usar?",
    "option_a": "Amazon EC2",
    "option_b": "AWS CloudFormation",
    "option_c": "Amazon QuickSight",
    "option_d": "Amazon Elastic Container Service (Amazon ECS)",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS CloudFormation permite a infraestrutura como código para provisionar e atualizar ambientes de forma consistente.",
    "incorrect_explanations": {
      "A": "O EC2 sozinho requer a configuração manual de recursos dependentes.",
      "C": "O QuickSight é para BI e painéis, não para provisionamento de ambientes.",
      "D": "O ECS executa contêineres, mas não modela ambientes inteiros como código por si só."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-187",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um desenvolvedor quer implantar uma aplicação rapidamente na AWS sem criar manualmente os recursos necessários. Qual serviço atende a essa necessidade?",
    "option_a": "Amazon EC2",
    "option_b": "AWS Elastic Beanstalk",
    "option_c": "AWS CodeBuild",
    "option_d": "Amazon Personalize",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Elastic Beanstalk provisiona e gerencia recursos (computação, escalonamento, balanceamento de carga) para plataformas de aplicação suportadas.",
    "incorrect_explanations": {
      "A": "O EC2 requer provisionamento e configuração manual.",
      "C": "O CodeBuild compila/testa o código; não implanta pilhas completas por si só.",
      "D": "O Personalize é para recomendações, não para implantação de aplicativos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-188",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais serviços da AWS podem ajudar a alcançar uma arquitetura fracamente acoplada? (Selecione DOIS)",
    "option_a": "Amazon WorkSpaces",
    "option_b": "Amazon Simple Queue Service (Amazon SQS)",
    "option_c": "Amazon Connect",
    "option_d": "AWS Trusted Advisor",
    "option_e": "AWS Step Functions",
    "correct_answers": [
      "B",
      "E"
    ],
    "explanation_detailed": "O SQS desacopla componentes com filas duráveis, e o Step Functions coordena serviços via máquinas de estado para fluxos de trabalho resilientes.",
    "incorrect_explanations": {
      "A": "O WorkSpaces é uma solução DaaS, não relacionada ao desacoplamento de aplicativos.",
      "C": "O Amazon Connect é um serviço de contact center, não uma ferramenta de desacoplamento de aplicativos.",
      "D": "O Trusted Advisor fornece verificações de melhores práticas, não desacoplamento de sistemas."
    }
  },
  {
    "id": "clf-c02-security_compliance-189",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa precisa controlar o tráfego de entrada e saída para uma instância do Amazon EC2. Qual recurso da AWS pode ser associado à instância para atender a esse requisito?",
    "option_a": "ACL de Rede",
    "option_b": "Grupo de segurança",
    "option_c": "AWS WAF",
    "option_d": "Tabelas de rotas da VPC",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "Um grupo de segurança atua como um firewall virtual com estado anexado à interface de rede da instância para controlar o tráfego.",
    "incorrect_explanations": {
      "A": "As ACLs de Rede se aplicam no limite da sub-rede, não por instância.",
      "C": "O AWS WAF protege aplicações web na Camada 7, não as ENIs da instância do EC2.",
      "D": "As tabelas de rotas direcionam o tráfego, mas não o filtram."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-190",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa tem 5 TB de dados no Amazon S3 e planeja executar consultas ocasionais para análise. Qual serviço da AWS é a maneira mais econômica de executar essas consultas?",
    "option_a": "Amazon Redshift",
    "option_b": "Amazon Athena",
    "option_c": "Amazon Kinesis",
    "option_d": "Amazon RDS",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon Athena é um serviço de consulta interativo sem servidor que executa SQL diretamente nos dados do S3; você paga por dados escaneados.",
    "incorrect_explanations": {
      "A": "O Redshift é um data warehouse provisionado; não é econômico para consultas ocasionais.",
      "C": "O Kinesis é para ingestão de dados em streaming, não para consultas ad hoc no S3.",
      "D": "O RDS é um banco de dados relacional, não para consultar objetos do S3 diretamente."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-191",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Uma empresa quer migrar seu banco de dados para um serviço gerenciado da AWS compatível com PostgreSQL. Quais serviços atendem a esses requisitos? (Selecione DOIS)",
    "option_a": "Amazon Athena",
    "option_b": "Amazon RDS",
    "option_c": "Amazon EC2",
    "option_d": "Amazon DynamoDB",
    "option_e": "Amazon Aurora",
    "correct_answers": [
      "B",
      "E"
    ],
    "explanation_detailed": "O Amazon RDS for PostgreSQL e o Amazon Aurora PostgreSQL-Compatible Edition fornecem bancos de dados gerenciados compatíveis com PostgreSQL.",
    "incorrect_explanations": {
      "A": "O Athena consulta dados no S3; não é um banco de dados PostgreSQL gerenciado.",
      "C": "O EC2 é computação autogerenciada, não um serviço PostgreSQL gerenciado.",
      "D": "O DynamoDB é um banco de dados NoSQL, não compatível com PostgreSQL."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-192",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma aplicação tem alto uso em horários específicos do dia. A empresa quer reduzir o número de instâncias do Amazon EC2 quando o uso for baixo. Qual recurso da AWS deve ser usado?",
    "option_a": "EC2 Instance Savings Plans",
    "option_b": "Instâncias Spot",
    "option_c": "Instâncias Reservadas",
    "option_d": "Amazon EC2 Auto Scaling",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Amazon EC2 Auto Scaling ajusta automaticamente o número de instâncias com base na demanda ou em agendamentos para otimizar os custos.",
    "incorrect_explanations": {
      "A": "Os Savings Plans afetam o preço, não o escalonamento da capacidade.",
      "B": "As Instâncias Spot alteram o preço/interrupção, não a política de escalonamento.",
      "C": "As Instâncias Reservadas são compromissos de compra, não mecanismos de escalonamento."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-193",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa migrará uma aplicação monolítica local para a AWS e a dividirá em microsserviços. Qual prática recomendada do AWS Well-Architected isso segue?",
    "option_a": "Integrar testes funcionais como parte da implantação na AWS.",
    "option_b": "Usar automação para implantar alterações.",
    "option_c": "Implantar a aplicação em vários locais.",
    "option_d": "Implementar dependências fracamente acopladas.",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "A decomposição em microsserviços reduz o acoplamento forte, melhorando a escalabilidade, a resiliência e a agilidade — orientação chave do Well-Architected.",
    "incorrect_explanations": {
      "A": "O teste é importante, mas não é o princípio central descrito.",
      "B": "A automação é valiosa, mas não aborda especificamente o acoplamento.",
      "C": "Multi-Região ou multi-AZ ajuda na disponibilidade; não se trata de desacoplamento."
    }
  },
  {
    "id": "clf-c02-security_compliance-194",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS permite a criptografia em repouso para objetos do Amazon S3?",
    "option_a": "Políticas do IAM",
    "option_b": "Criptografia do lado do servidor",
    "option_c": "Amazon GuardDuty",
    "option_d": "Criptografia do lado do cliente",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "A criptografia do lado do servidor do Amazon S3 criptografa objetos antes de armazená-los e os descriptografa na recuperação, usando chaves gerenciadas pelo S3 ou pelo KMS.",
    "incorrect_explanations": {
      "A": "As políticas do IAM controlam o acesso, mas não realizam a criptografia.",
      "C": "O GuardDuty é um serviço de detecção de ameaças, não relacionado à criptografia do S3.",
      "D": "A criptografia do lado do cliente é realizada pelo cliente, não pelo S3; a pergunta se refere ao recurso do S3."
    }
  },
  {
    "id": "clf-c02-security_compliance-195",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Um engenheiro de TI precisa acessar os serviços da AWS a partir de uma aplicação local. Quais credenciais são necessárias para a autenticação?",
    "option_a": "Nome de usuário e senha da conta da AWS",
    "option_b": "Chave de acesso e chave secreta do IAM",
    "option_c": "Pares de chaves do Amazon EC2",
    "option_d": "Chaves do AWS Key Management Service (AWS KMS)",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O acesso programático às APIs da AWS requer chaves de acesso do IAM (ID da chave de acesso e chave de acesso secreta).",
    "incorrect_explanations": {
      "A": "As senhas do console são para login interativo, não para autenticação de API.",
      "C": "Os pares de chaves do EC2 são para SSH em instâncias, não para chamadas de API da AWS.",
      "D": "As chaves do KMS criptografam dados; não são credenciais de identidade."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-196",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "hard",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa migrará uma aplicação de HPC com vários componentes para o Amazon EC2. A solução deve ser tolerante a falhas com failover automático e a menor latência entre os componentes. Qual abordagem de infraestrutura da AWS atende a esses requisitos?",
    "option_a": "Várias Regiões da AWS",
    "option_b": "Vários locais de borda",
    "option_c": "Várias Zonas de Disponibilidade",
    "option_d": "Caches de borda regionais",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "A distribuição de componentes em várias Zonas de Disponibilidade fornece alta disponibilidade com conectividade de baixa latência dentro de uma Região.",
    "incorrect_explanations": {
      "A": "A comunicação entre Regiões introduz maior latência.",
      "B": "Os locais de borda são para CDN (CloudFront), não para rede entre componentes de HPC.",
      "D": "Os caches de borda regionais são recursos de CDN, não relacionados à comunicação de componentes do EC2."
    }
  },
  {
    "id": "clf-c02-cloud_concepts-197",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_CONCEPTS",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Na AWS, elasticidade se refere a quais DOIS conceitos? (Selecione DOIS)",
    "option_a": "A rapidez com que uma instância do Amazon EC2 pode ser reiniciada",
    "option_b": "A capacidade de ajustar os recursos à medida que a demanda muda",
    "option_c": "A RAM máxima que uma instância do Amazon EC2 pode usar",
    "option_d": "Modelo de precificação pague-conforme-o-uso",
    "option_e": "A facilidade com que os recursos podem ser obtidos quando necessários",
    "correct_answers": [
      "B",
      "E"
    ],
    "explanation_detailed": "Elasticidade é a capacidade de adquirir e liberar recursos dinamicamente para corresponder à demanda e obtê-los rapidamente quando necessário.",
    "incorrect_explanations": {
      "A": "O tempo de reinicialização não é a definição de elasticidade.",
      "C": "Os limites de RAM da instância são dimensionamento, não elasticidade.",
      "D": "Pague-conforme-o-uso é um modelo de precificação, não elasticidade."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-198",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais serviços ou recursos da AWS permitem que os usuários criem uma conexão de rede entre duas VPCs? (Selecione DOIS)",
    "option_a": "Endpoints da VPC",
    "option_b": "Amazon Route 53",
    "option_c": "Emparelhamento de VPC",
    "option_d": "AWS Direct Connect",
    "option_e": "AWS Transit Gateway",
    "correct_answers": [
      "C",
      "E"
    ],
    "explanation_detailed": "O emparelhamento de VPC conecta duas VPCs diretamente, e o AWS Transit Gateway fornece conectividade hub-and-spoke escalável entre várias VPCs.",
    "incorrect_explanations": {
      "A": "Os endpoints da VPC conectam uma VPC a serviços da AWS de forma privada, não de VPC para VPC.",
      "B": "O Route 53 é DNS e não cria links de rede entre VPCs.",
      "D": "O Direct Connect conecta redes locais à AWS, não de VPC para VPC diretamente."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-199",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa está ficando sem espaço em sua biblioteca de fitas físicas para backups e precisa estender a capacidade para a AWS. Qual serviço deve ser usado?",
    "option_a": "Amazon Elastic File System (Amazon EFS)",
    "option_b": "Amazon Elastic Block Store (Amazon EBS)",
    "option_c": "Amazon S3",
    "option_d": "AWS Storage Gateway",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O Tape Gateway do AWS Storage Gateway fornece fitas virtuais com suporte do S3 e do Glacier, estendendo a capacidade de fita para a nuvem.",
    "incorrect_explanations": {
      "A": "O EFS é um sistema de arquivos POSIX para o EC2, não uma solução de fita virtual.",
      "B": "O EBS é armazenamento de blocos para o EC2 e não emula fitas.",
      "C": "O S3 é armazenamento de objetos; o Tape Gateway se integra aos fluxos de trabalho de backup de forma transparente."
    }
  },
  {
    "id": "clf-c02-security_compliance-200",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece criptografia em repouso para volumes do Amazon RDS e do Amazon Elastic Block Store (Amazon EBS)?",
    "option_a": "AWS Lambda",
    "option_b": "AWS Key Management Service (AWS KMS)",
    "option_c": "AWS WAF",
    "option_d": "Amazon Rekognition",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS KMS gerencia chaves de criptografia e se integra ao RDS e ao EBS para permitir a criptografia em repouso.",
    "incorrect_explanations": {
      "A": "O Lambda é computação, não um serviço de gerenciamento de chaves.",
      "C": "O AWS WAF é um firewall de aplicação web e não criptografa dados em repouso.",
      "D": "O Rekognition é para análise de imagem/vídeo, não para criptografia."
    }
  },
  {
    "id": "clf-c02-billing_pricing-201",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa quer revisar periodicamente sua conta da AWS em busca de oportunidades de otimização de custos. Qual ferramenta da AWS deve ser usada?",
    "option_a": "AWS Cost Explorer",
    "option_b": "AWS Trusted Advisor",
    "option_c": "Calculadora de Preços da AWS",
    "option_d": "AWS Budgets",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O AWS Cost Explorer permite visualizar e analisar custos e uso ao longo do tempo para identificar oportunidades de otimização.",
    "incorrect_explanations": {
      "B": "O Trusted Advisor fornece verificações de melhores práticas, mas a pergunta se refere à ferramenta usada para revisar periodicamente os custos e as tendências de uso.",
      "C": "A Calculadora de Preços estima os custos para arquiteturas planejadas; não é para revisão contínua da conta.",
      "D": "O AWS Budgets alerta sobre limites; não analisa padrões históricos de gastos."
    }
  },
  {
    "id": "clf-c02-security_compliance-202",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS pode identificar quando uma instância do Amazon EC2 foi encerrada?",
    "option_a": "AWS Identity and Access Management (IAM)",
    "option_b": "AWS CloudTrail",
    "option_c": "AWS Compute Optimizer",
    "option_d": "Amazon EventBridge",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS CloudTrail registra chamadas de API e eventos. O evento da API TerminateInstances indica quando uma instância do EC2 foi encerrada e por quem/o quê.",
    "incorrect_explanations": {
      "A": "O IAM gerencia identidades e permissões; não registra eventos de encerramento.",
      "C": "O Compute Optimizer fornece recomendações de dimensionamento correto; não registra eventos do ciclo de vida.",
      "D": "O EventBridge pode reagir a mudanças de estado, mas o CloudTrail é a fonte de auditoria para identificar a atividade de encerramento."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-203",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Fábricas precisam de processamento, armazenamento e execução de aplicativos locais com baixa latência e interdependências locais. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS IoT Greengrass",
    "option_b": "AWS Lambda",
    "option_c": "AWS Outposts",
    "option_d": "AWS Snowball Edge",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS Outposts entrega infraestrutura e serviços AWS totalmente gerenciados no local para cargas de trabalho híbridas de baixa latência.",
    "incorrect_explanations": {
      "A": "O IoT Greengrass executa lógica de borda para dispositivos, não infraestrutura/serviços completos da AWS no local.",
      "B": "O Lambda é um serviço sem servidor nas Regiões da AWS; não implanta infraestrutura gerenciada localmente.",
      "D": "O Snowball Edge é ideal para computação de borda temporária/portátil e transferência de dados, não para racks híbridos persistentes."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-204",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Uma empresa criou um Relatório de Custos e Uso da AWS (CUR) e quer visualizá-lo. Qual serviço deve ingerir e exibi-lo?",
    "option_a": "Amazon QuickSight",
    "option_b": "Amazon Pinpoint",
    "option_c": "Amazon Neptune",
    "option_d": "Amazon Kinesis",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "O Amazon QuickSight pode consultar dados do CUR (geralmente via S3+Athena/Redshift) e fornecer painéis e visualizações de BI.",
    "incorrect_explanations": {
      "B": "O Pinpoint é para análises e mensagens de engajamento do usuário, não para painéis de BI do CUR.",
      "C": "O Neptune é um banco de dados de grafos, não uma ferramenta de visualização de BI.",
      "D": "O Kinesis move/transmite dados; não é um serviço de visualização."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-205",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Muitas instâncias Linux do EC2 em várias Zonas de Disponibilidade precisam acessar um conjunto comum de arquivos. Qual serviço da AWS deve ser usado?",
    "option_a": "AWS Backup",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "AWS Snowball Edge",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon EFS é um sistema de arquivos NFS gerenciado que pode ser montado simultaneamente por várias instâncias do EC2 em diferentes Zonas de Disponibilidade.",
    "incorrect_explanations": {
      "A": "O AWS Backup centraliza os backups; não é um sistema de arquivos compartilhado.",
      "C": "Os volumes do EBS se anexam a uma única instância de AZ por vez; não são multi-anexáveis em muitas instâncias/AZs (exceto para uso especializado).",
      "D": "O Snowball Edge é para transferência/computação de borda, não um sistema de arquivos compartilhado regional."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-206",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece armazenamento que pode ser montado por várias instâncias do Amazon EC2 simultaneamente?",
    "option_a": "Amazon WorkSpaces",
    "option_b": "Amazon Elastic File System (Amazon EFS)",
    "option_c": "AWS Database Migration Service (AWS DMS)",
    "option_d": "AWS Snowball Edge",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O Amazon EFS expõe um sistema de arquivos NFS para montagens simultâneas por muitas instâncias do EC2.",
    "incorrect_explanations": {
      "A": "O WorkSpaces é um serviço de desktop virtual, não armazenamento compartilhado.",
      "C": "O DMS migra bancos de dados; não é um sistema de arquivos.",
      "D": "O Snowball Edge é um dispositivo portátil; não é um sistema de arquivos compartilhado regional."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-207",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Usuários de BI querem fazer perguntas em linguagem natural e obter respostas com visualizações relevantes. Qual capacidade da AWS deve ser usada?",
    "option_a": "Amazon Macie",
    "option_b": "Amazon Rekognition",
    "option_c": "Amazon QuickSight Q",
    "option_d": "Amazon Lex",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O QuickSight Q permite perguntas em linguagem natural sobre os dados, retornando visualizações instantâneas para perguntas de negócios.",
    "incorrect_explanations": {
      "A": "O Macie descobre dados sensíveis no S3; não é uma ferramenta de perguntas em linguagem natural de BI.",
      "B": "O Rekognition analisa imagens/vídeos, não perguntas de BI.",
      "D": "O Lex constrói chatbots; o Q é projetado para responder a perguntas de BI."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-208",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Quais serviços da AWS podem ser usados para armazenar arquivos? (Selecione DOIS)",
    "option_a": "Amazon S3",
    "option_b": "AWS Lambda",
    "option_c": "Amazon Elastic Block Store (Amazon EBS)",
    "option_d": "Amazon SageMaker",
    "option_e": "AWS Storage Gateway",
    "correct_answers": [
      "A",
      "C"
    ],
    "explanation_detailed": "O S3 armazena objetos em escala e o EBS fornece armazenamento de blocos para instâncias do EC2, ambos adequados para dados de arquivos, dependendo dos padrões de acesso.",
    "incorrect_explanations": {
      "B": "O Lambda é computação, não um serviço de armazenamento.",
      "D": "O SageMaker é uma plataforma de ML, não um armazenamento de arquivos primário.",
      "E": "O Storage Gateway faz a ponte entre o local e o armazenamento da AWS; é um gateway, não o armazenamento de suporte em si."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-209",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 2,
    "active": true,
    "question_text": "Preparando-se para lançar uma aplicação web em uma segunda Região da AWS, quais serviços são configurados no escopo Regional? (Selecione DOIS)",
    "option_a": "Amazon EC2",
    "option_b": "Amazon Route 53",
    "option_c": "Amazon CloudFront",
    "option_d": "AWS WAF",
    "option_e": "Amazon DynamoDB",
    "correct_answers": [
      "A",
      "E"
    ],
    "explanation_detailed": "O EC2 e o DynamoDB são serviços Regionais que operam de forma independente por Região e exigem configuração por Região.",
    "incorrect_explanations": {
      "B": "O Route 53 é um serviço de DNS global.",
      "C": "O CloudFront é uma CDN global com locais de borda, não uma configuração por Região para disponibilidade de origem.",
      "D": "O AWS WAF é gerenciado por escopo (Regional/CloudFront), mas não é tipicamente um fator para lançar uma aplicação em uma nova Região."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-210",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço da AWS fornece infraestrutura como código (IaC) para gerenciar recursos declarativamente?",
    "option_a": "AWS CodePipeline",
    "option_b": "AWS CodeDeploy",
    "option_c": "AWS Direct Connect",
    "option_d": "AWS CloudFormation",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "O AWS CloudFormation permite modelar, provisionar e gerenciar recursos por meio de modelos.",
    "incorrect_explanations": {
      "A": "O CodePipeline orquestra pipelines de CI/CD, não modelos de IaC para todos os recursos.",
      "B": "O CodeDeploy automatiza implantações; não é IaC para provisionamento de infraestrutura.",
      "C": "O Direct Connect é rede, não IaC."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-211",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Pesquisadores coletam dados em locais remotos sem internet e precisam transferi-los para a AWS posteriormente. Qual oferta da AWS se encaixa?",
    "option_a": "AWS Outposts",
    "option_b": "AWS Transfer Family",
    "option_c": "Família AWS Snow",
    "option_d": "AWS Migration Hub",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "Os dispositivos da Família AWS Snow permitem a captura e o transporte de dados offline para a AWS a partir de ambientes desconectados ou robustos.",
    "incorrect_explanations": {
      "A": "O Outposts fornece infraestrutura AWS local com conectividade de rede; não é um dispositivo de ingestão portátil.",
      "B": "O Transfer Family depende de conectividade de rede (SFTP/FTPS/FTP).",
      "D": "O Migration Hub rastreia migrações; não move dados offline."
    }
  },
  {
    "id": "clf-c02-billing_pricing-212",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Definir metas de gastos com a AWS e acompanhar os custos reais/previstos em relação a elas. Qual ferramenta deve ser usada?",
    "option_a": "AWS Cost Explorer",
    "option_b": "AWS Budgets",
    "option_c": "Relatório de Custos e Uso da AWS",
    "option_d": "Savings Plans",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O AWS Budgets permite definir orçamentos de custo/uso e receber alertas quando o real ou previsto excede os limites.",
    "incorrect_explanations": {
      "A": "O Cost Explorer analisa e prevê gastos, mas não impõe alertas de orçamento por si só.",
      "C": "O CUR são dados brutos de custo/uso, não uma ferramenta de orçamento.",
      "D": "Os Savings Plans são compromissos de preços, não orçamentos."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-213",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "medium",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Precisa de um servidor de arquivos totalmente gerenciado que suporte nativamente cargas de trabalho da Microsoft e SMB. Qual serviço se encaixa?",
    "option_a": "Amazon Elastic File System (Amazon EFS)",
    "option_b": "Amazon FSx for Lustre",
    "option_c": "Amazon FSx for Windows File Server",
    "option_d": "Amazon Elastic Block Store (Amazon EBS)",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O Amazon FSx for Windows File Server fornece compartilhamentos de arquivos do Windows totalmente gerenciados sobre SMB com integração AD.",
    "incorrect_explanations": {
      "A": "O EFS é um sistema de arquivos POSIX NFS para Linux, não Windows SMB.",
      "B": "O FSx for Lustre visa cargas de trabalho POSIX de alto desempenho, não SMB.",
      "D": "O EBS é armazenamento de blocos, não um serviço de arquivos SMB gerenciado."
    }
  },
  {
    "id": "clf-c02-security_compliance-214",
    "certification_id": "CLF-C02",
    "domain": "SECURITY_COMPLIANCE",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual recurso da AWS aplica regras de segurança sem estado no nível da sub-rede em uma VPC?",
    "option_a": "ACLs de Rede",
    "option_b": "Grupos de segurança",
    "option_c": "AWS Certificate Manager (ACM)",
    "option_d": "AWS Config",
    "correct_answers": [
      "A"
    ],
    "explanation_detailed": "As ACLs de Rede são filtros sem estado no nível da sub-rede que controlam o tráfego de entrada e saída.",
    "incorrect_explanations": {
      "B": "Os grupos de segurança são com estado e aplicados a ENIs/instâncias, não a sub-redes.",
      "C": "O ACM gerencia certificados, não regras de rede.",
      "D": "O AWS Config registra/avalia a configuração, não a filtragem de tráfego."
    }
  },
  {
    "id": "clf-c02-billing_pricing-215",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual prática recomendada da AWS garante mais diretamente a arquitetura mais econômica para uma carga de trabalho?",
    "option_a": "Acoplamento fraco",
    "option_b": "Dimensionamento correto (Right-sizing)",
    "option_c": "Cache",
    "option_d": "Redundância",
    "correct_answers": [
      "B"
    ],
    "explanation_detailed": "O dimensionamento correto seleciona os tipos/tamanhos de recursos mais apropriados para atender aos requisitos e minimizar os custos.",
    "incorrect_explanations": {
      "A": "O acoplamento fraco melhora a resiliência/velocidade, mas não garante o menor custo.",
      "C": "O cache pode reduzir o custo indiretamente; não é universalmente a principal alavanca.",
      "D": "A redundância melhora a disponibilidade e muitas vezes aumenta o custo."
    }
  },
  {
    "id": "clf-c02-cloud_technology_services-216",
    "certification_id": "CLF-C02",
    "domain": "CLOUD_TECHNOLOGY_SERVICES",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual serviço fornece uma conexão de rede dedicada com baixa latência consistente do local para a AWS?",
    "option_a": "Amazon VPC",
    "option_b": "Amazon Kinesis Data Streams",
    "option_c": "AWS Direct Connect",
    "option_d": "Amazon OpenSearch Service",
    "correct_answers": [
      "C"
    ],
    "explanation_detailed": "O AWS Direct Connect estabelece conectividade dedicada entre sua rede e a AWS para taxa de transferência e latência estáveis.",
    "incorrect_explanations": {
      "A": "A VPC é uma rede virtual na AWS, não um link dedicado do local.",
      "B": "O Kinesis é um serviço de streaming, não de conectividade.",
      "D": "O OpenSearch é para pesquisa/análise, não para rede."
    }
  },
  {
    "id": "clf-c02-billing_pricing-217",
    "certification_id": "CLF-C02",
    "domain": "BILLING_PRICING",
    "difficulty": "easy",
    "tier": "FREE",
    "required_selection_count": 1,
    "active": true,
    "question_text": "Qual modelo de precificação do EC2 pode oferecer até ~90% de desconto em comparação com o Sob Demanda?",
    "option_a": "Instâncias Reservadas",
    "option_b": "Sob Demanda",
    "option_c": "Hosts Dedicados",
    "option_d": "Instâncias Spot",
    "correct_answers": [
      "D"
    ],
    "explanation_detailed": "As Instâncias Spot usam capacidade ociosa com grandes descontos; interrupções são possíveis.",
    "incorrect_explanations": {
      "A": "As RIs fornecem economia para uso estável, mas geralmente menos do que as Spot.",
      "B": "Sob Demanda oferece flexibilidade a taxas padrão.",
      "C": "Os Hosts Dedicados fornecem isolamento/controle de capacidade, não descontos máximos."
    }
  }
]